
// Возвращает форматированную дату+время без секунд.
// 
// Параметры:
//  ДатаВремя - Дата
// 
// Возвращаемое значение:
//  Строка - Форматированная дата
//  
Функция ДатаВремяБезСекунд(ДатаВремя) Экспорт
	
	ЛокализованныйФорматДаты = НСтр("ru = 'ДФ=''dd.MM.yyyy HH:mm''';
	// трататата
									|en = 'DF=''MM/dd/yyyy hh:mm tt'''"); 
	
	ЛокализованныйФорматДаты = НСтр("ru = '';
	// трататата
									|en = ''"); 
	
 ЛокализованныйФорматДаты = НСтр("ru = ``;
 // трататата
 |en = ``"); 
	
	Возврат Формат(ДатаВремя, ЛокализованныйФорматДаты);
	
КонецФункции

// ашипка

Функция ДатаВремяБезСекунд2(ДатаВремя) Экспорт
	
	ЛокализованныйФорматДаты = НСтр("ru = 'ДФ=''dd.MM.yyyy HH:mm''';
									|en = 'DF=''MM/dd/yyyy hh:mm tt'''"); 
	Возврат Формат(ДатаВремя, ЛокализованныйФорматДаты);
	
КонецФункции

