///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИнформационнуюСсылкуПереносаДанных(ИмяИсточника, ИнформационнаяСсылка) Экспорт
	
	ТекстыОшибок = Новый Массив;
	
	// АПК:БЗК.1036-выкл, АПК:78-выкл
	// пользователям хеш показываем как "хэш"
	ТекстыОшибок.Добавить(НСтр("ru = 'Будет предпринята попытка актуализации Хэша ЭЛН'")); 
	// АПК:БЗК.1036-вкл
	
	// хэш
	
	Если ИмяИсточника = "ЗарплатаИУправлениеПерсоналом" Тогда
		ИнформационнаяСсылка = "http://its.1c.ru/db/metod81#content:5501:1";
	ИначеЕсли ИмяИсточника = "Зарплата+Кадры. Редакция 2.3" Тогда
		ИнформационнаяСсылка = "http://its.1c.ru/db/metod81#content:6219:hdoc";
	ИначеЕсли ИмяИсточника = "БухгалтерияПредприятияКОРП" Тогда
		ИнформационнаяСсылка = "";
	КонецЕсли;
	
КонецПроцедуры

Асинх Функция фывафыва()
	
КонецФункции

#КонецОбласти
