///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьЗарплатуРаботниковЗавершение", ЭтотОбъект, ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма._ДемоУстановитьЗарплатуРаботников", , ПараметрыВыполненияКоманды.Источник, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗарплатуРаботниковЗавершение(РезультатыРедактирования, ПараметрКоманды) Экспорт
	
	Если РезультатыРедактирования <> Неопределено Тогда
		УстановитьЗарплатуРаботниковЗавершениеНаСервере(РезультатыРедактирования, ПараметрКоманды)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗарплатуРаботниковЗавершениеНаСервере(РезультатыРедактирования, ПараметрКоманды) Экспорт
	
	ЗарплатаРаботников = ПолучитьИзВременногоХранилища(РезультатыРедактирования);
	
	Ведомость = ПараметрКоманды.ПолучитьОбъект();
	Ведомость.УстановитьЗарплатуРаботников(ЗарплатаРаботников);
	Ведомость.Записать();
	
КонецПроцедуры
