///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура АвтоформатироватьКод(Параметр1) Экспорт 
	
	//ОткрытьФорму("Обработка.АвтоформатированиеКода.Форма", Новый Структура("ЗапуститьИЗавершить", Истина));
	
	//АФ = Обработки.АвтоформатированиеКода.Создать();
	//
	//Параметры = АФ.ПолучитьПараметрыАвтоформатированияПоУмолчанию();
	////Параметры.ПутьКБазе = "F:\Work\forward\1S\АПК\Проверки\ДемоБаза";
	//Параметры.ОбновитьКонфигурациюБДПослеЗагрузкиМодулей = Истина;
	////Параметры.Пароль = "";
	//
	//Статус = АФ.АвтоформатироватьКод(Параметры);
	//Если НЕ ПустаяСтрока(Статус) Тогда 
	//	Сообщить(Статус);
	//КонецЕсли;
	
	
	// изменение в хранилище!!!
	
КонецПроцедуры

//adf

Процедура фывафыва()
	
	//фыва = АвтоформатироватьКод(
	//	фывафыва,
	//	,
	//	23456);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НеиспользуемаяФункция1() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти
