///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область Инициализация

ТекстЗапроса = "
|ВЫБРАТЬ
|	РазрешениеНаЗаменуАналогиПереопределяемый.Номенклатура,
|	РазрешениеНаЗаменуАналогиПереопределяемый.Характеристика,
|	РазрешениеНаЗаменуАналогиПереопределяемый.НомерСтроки,
|	РазрешениеНаЗаменуАналогиПереопределяемый.Количество * &Кратность КАК Количество,
|	ВЫРАЗИТЬ(РазрешениеНаЗаменуАналогиПереопределяемый.Количество * &Кратность / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок,
|	РазрешениеНаЗаменуАналогиПереопределяемый.Упаковка,
|	РазрешениеНаЗаменуАналогиПереопределяемый.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	&ТекстПолеСклад КАК Склад,
|	ВЫБОР
|		КОГДА РазрешениеНаЗаменуАналогиПереопределяемый.Номенклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК ХарактеристикиИспользуются,
|	ВЫРАЗИТЬ(ЕСТЬNULL(ОстаткиСкладаПереопределяемый.ВНаличииОстаток, 0) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
|	ВЫРАЗИТЬ(
|		(ЕСТЬNULL(ОстаткиСкладаПереопределяемый.ВНаличииОстаток - ОстаткиСкладаПереопределяемый.ВРезервеСоСкладаОстаток - ОстаткиСкладаПереопределяемый.ВРезервеПодЗаказОстаток, 0)
|			+ ЕСТЬNULL(РезервГрафикаПереопределяемый.Количество, 0))
|		/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК ЧИСЛО(15, 3)) КАК Доступно
|ИЗ
|	Документ.РазрешениеНаЗаменуМатериалов.Аналоги КАК РазрешениеНаЗаменуАналогиПереопределяемый
|		//ТекстЗапросаНастройкиПередачиМатериалов//
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(, {(Номенклатура).* КАК Номенклатура, (Характеристика).* КАК Характеристика}) КАК ОстаткиСкладаПереопределяемый
|		ПО ОстаткиСкладаПереопределяемый.Склад = &ТекстПолеСклад
|			И РазрешениеНаЗаменуАналогиПереопределяемый.Номенклатура = ОстаткиСкладаПереопределяемый.Номенклатура
|			И РазрешениеНаЗаменуАналогиПереопределяемый.Характеристика = ОстаткиСкладаПереопределяемый.Характеристика
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК РезервГрафикаПереопределяемый
|		ПО РезервГрафикаПереопределяемый.Склад = &ТекстПолеСклад
|			И РазрешениеНаЗаменуАналогиПереопределяемый.Номенклатура = РезервГрафикаПереопределяемый.Номенклатура
|			И РазрешениеНаЗаменуАналогиПереопределяемый.Характеристика = РезервГрафикаПереопределяемый.Характеристика
|			И РезервГрафикаПереопределяемый.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
|			И РезервГрафикаПереопределяемый.Количество < 0
|
|ГДЕ
|	РазрешениеНаЗаменуАналогиПереопределяемый.Ссылка = &Ссылка";

#КонецОбласти
