///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ВнешнееСобытиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	ВнешнееСобытиеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры

