///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТаблицаТиповОбъектов;

#КонецОбласти

#Область ПроцедурыИФункцииДляВызоваОбработкиИзКонфигурации

// Процедура предназначена для вызова из кода исправляемой конфигурации,
// например, из регламентного задания по расписанию.
//
Функция АвтоформатироватьКод(ПараметрыАвтоформатирования = Неопределено) Экспорт
	
	Статус = ПроверитьПлатформу836();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыАвтоформатирования) <> Тип("Структура") Тогда
		ПараметрыАвтоформатирования = ПолучитьПараметрыАвтоформатированияПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьПараметры(ПараметрыАвтоформатирования);
	
	ХранилищеУказано = НЕ ПустаяСтрока(КаталогХранилища);
	
	Если ВыгружатьКонфигурациюВФайлыXML Тогда
		
		// Если указан список захваченных объектов, то только заполняем таблицу.
		Если НЕ ПустаяСтрока(СписокЗахваченныхОбъектов) Тогда
			
			Статус = ЗаполнитьТаблицуЗахваченныхОбъектов(СписокЗахваченныхОбъектов, Ложь);
			Если НЕ ПустаяСтрока(Статус) Тогда 
				Возврат Статус;
			КонецЕсли;
			
		// Если заполнен каталог с хранилищем, то работаем с ним.
		ИначеЕсли ХранилищеУказано Тогда
			
			// Если флаг "Помещать обработанные объекты в хранилище" установлен,
			Если ПомещатьИзмененныеОбъектыВХранилище Тогда
				// то подключаемся к хранилищу.
				Статус = ПодключитьКонфигурациюКХранилищу();
				Если НЕ ПустаяСтрока(Статус) Тогда 
					Возврат Статус;
				КонецЕсли;
				
				// И пытаемся захватить в нем все объекты.
				Статус = ЗахватитьОбъектыКонфигурацииВХранилище();
				Если НЕ ПустаяСтрока(Статус) Тогда 
					Возврат Статус;
				КонецЕсли;
			Иначе
				// Если флаг не установлен, то только загружаем конфигурацию из хранилища.
				Статус = ЗагрузитьКонфигурациюИзХранилища();
				Если НЕ ПустаяСтрока(Статус) Тогда 
					Возврат Статус;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Статус = ВыгрузитьКонфигурациюВФайлыXML();
		Если НЕ ПустаяСтрока(Статус) Тогда 
			Возврат Статус;
		КонецЕсли;
		
		СкопироватьКаталогВыгрузки(КаталогВыгрузки, КаталогВыгрузкиРезультат);
		
	КонецЕсли;
	
	ЗаполнитьПравилаПоддержки();
	
	ЗаполнитьРезультат();
	
	ОбработатьТекстыМодулей();
	
	ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектов();
	
	Если ЗагружатьКонфигурациюИзФайловXML Тогда
		
		Статус = ЗагрузитьКонфигурациюИзФайловXML();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
		Если ОбновитьКонфигурациюБД Тогда
			Статус = ОбновитьКонфигурациюБД();
			Если НЕ ПустаяСтрока(Статус) Тогда
				Возврат Статус;
			КонецЕсли;
		КонецЕсли;
		
		ОчиститьКаталогиВыгрузки("");
		
	КонецЕсли;
	
	Если ХранилищеУказано И ПомещатьИзмененныеОбъектыВХранилище Тогда
		
		Статус = ПоместитьИзмененныеОбъектыВХранилище();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
		Статус = ОтменитьЗахватОбъектовВХранилище();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

// Функция предназначена для вызова из кода исправляемой конфигурации.
// Получает значения флагов для исправления по умолчанию.
// 
Функция ПолучитьПараметрыАвтоформатированияПоУмолчанию() Экспорт 
	
	ПараметрыАвтоформатирования = Новый Структура;
	ПараметрыАвтоформатирования.Вставить("ПутьКБазе", СтрокаСоединенияИнформационнойБазы());
	ПараметрыАвтоформатирования.Вставить("Пользователь", ИмяПользователя());
	ПараметрыАвтоформатирования.Вставить("Пароль", "");
	ПараметрыАвтоформатирования.Вставить("КаталогВыгрузкиXML", КаталогВременныхФайлов());
	ПараметрыАвтоформатирования.Вставить("ОбновитьКонфигурациюБД", Ложь);
	ПараметрыАвтоформатирования.Вставить("КаталогХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПользовательХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПарольХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПомещатьИзмененныеОбъектыВХранилище", Ложь);
	ПараметрыАвтоформатирования.Вставить("СтрокаЗапускаПлатформы", КаталогПрограммы() + "1cv8.exe");
	ПараметрыАвтоформатирования.Вставить("СписокИзмененныхОбъектов", ПолучитьИмяВременногоФайла("xml"));
	ПараметрыАвтоформатирования.Вставить("ВыгружатьКонфигурациюВФайлыXML", Истина);
	ПараметрыАвтоформатирования.Вставить("ЗагружатьКонфигурациюИзФайловXML", Истина);
	ПараметрыАвтоформатирования.Вставить("ТекстКомментария", "");
	ПараметрыАвтоформатирования.Вставить("СписокЗахваченныхОбъектов", "");
	ПараметрыАвтоформатирования.Вставить("ТекстПреамбулыПрограммныхМодулей", ПолучитьТекстПреамбулы());
	
	Возврат ПараметрыАвтоформатирования;
	
КонецФункции

Функция ПолучитьИмяФайлаБезРасширения(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Возврат Файл.ИмяБезРасширения;
	
КонецФункции

Процедура ЗаполнитьПараметры(Знач ПараметрыАвтоформатирования)
	
	// Заполняем параметры "КаталогВыгрузки" и "КаталогВыгрузкиРезультат".
	КаталогВыгрузкиXML = ПараметрыАвтоформатирования.КаталогВыгрузкиXML;
	// Если каталог выгрузки не передан, то заполняем временными каталогами.
	Если ПустаяСтрока(КаталогВыгрузкиXML) Тогда
		КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
		КаталогВыгрузкиРезультат = ПолучитьИмяВременногоФайла("");
	ИначеЕсли ПараметрыАвтоформатирования.ВыгружатьКонфигурациюВФайлыXML Тогда
		// Если передан каталог выгрузки и необходимость выгрузки в файлы XML,
		// то заполняем переданный каталог временными каталогами.
		КаталогВыгрузкиXML = СокрЛП(КаталогВыгрузкиXML);
		КаталогДобавитьСлэш(КаталогВыгрузкиXML);
		
		ИмяФайла = ПолучитьИмяВременногоФайла("");
		ИмяФайла = ПолучитьИмяФайлаБезРасширения(ИмяФайла);
		КаталогВыгрузки = КаталогВыгрузкиXML + ИмяФайла;
		
		ИмяФайла = ПолучитьИмяВременногоФайла("");
		ИмяФайла = ПолучитьИмяФайлаБезРасширения(ИмяФайла);
		КаталогВыгрузкиРезультат = КаталогВыгрузкиXML + ИмяФайла;
	Иначе
		// Если передан каталог выгрузки, и не надо выгружать конфигурацию в файлы XML,
		// то заполняем им КаталогВыгрузкиРезультат, а КаталогВыгрузки - временным каталогом.
		КаталогВыгрузкиРезультат = КаталогВыгрузкиXML;
		КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
	КонецЕсли;
	
	КаталогДобавитьСлэш(КаталогВыгрузки);
	КаталогДобавитьСлэш(КаталогВыгрузкиРезультат);
	
	// Заполняем остальные параметры автоформатирования.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыАвтоформатирования);
	
	// Проверяем параметр "ПутьКБазе".
	Если ПустаяСтрока(ПутьКБазе) Тогда 
		ПутьКБазе = СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	
	// Проверяем параметр "Пользователь".
	Если ПустаяСтрока(Пользователь) Тогда 
		ТекущийПользователь = ИмяПользователя();
		Если ПустаяСтрока(ТекущийПользователь) Тогда 
			Пользователь = "";
			Пароль = "";
		Иначе 
			Пользователь = ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем путь к файлу со списком измененных объектов.
	Если ПустаяСтрока(СписокИзмененныхОбъектов) Тогда
		СписокИзмененныхОбъектов = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРезультат() Экспорт 
	
	Результат.Очистить();
	
	НайденныеФайлы = НайтиФайлы(КаталогВыгрузкиРезультат, "*.*", Истина);
	Для Каждого Файл Из НайденныеФайлы Цикл
		
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьОбъекта = ПолучитьПутьОбъектаИзФайлаВыгрузкиXML(Файл.ПолноеИмя);
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ПолноеИмяФайла = Файл.ПолноеИмя;
		НоваяСтрока.Объект = ПутьОбъекта;
		НоваяСтрока.Флаг = Истина;
		НоваяСтрока.Изменен = Ложь;
		НоваяСтрока.Результат = "сравнить";
		
		НоваяСтрока.ЗахваченВХранилище = ПолучитьСтатусЗахватаОбъектаВХранилище(ПутьОбъекта);
		НоваяСтрока.РедактированиеРазрешено = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуИзмененныхОбъектовНаСервере(ЗахваченВХранилище = Неопределено,
	РедактированиеРазрешено = Неопределено) Экспорт
	
	// Получаем только выбранные измененные файлы.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Изменен", Истина);
	СтруктураОтбора.Вставить("Флаг", Истина);
	
	Если ЗахваченВХранилище <> Неопределено Тогда
		СтруктураОтбора.Вставить("ЗахваченВХранилище", ЗахваченВХранилище);
	КонецЕсли;
	
	Если РедактированиеРазрешено <> Неопределено Тогда
		СтруктураОтбора.Вставить("РедактированиеРазрешено", РедактированиеРазрешено);
	КонецЕсли;
	
	Возврат Результат.Выгрузить(СтруктураОтбора);
	
КонецФункции

Процедура ЗаменитьПутиФайловФормВТаблицеИзмененныхФайлов(ТаблицаФайлов)
	
	// Для форм заменяем путь к измененному файлу путем к файлу XML формы как к объекту метаданных,
	// т.к. при указании, например, файла с модулем формы будет ошибка платформы при загрузке.
	// Модуль формы будет загружен автоматически при указании файла XML формы.
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		
		КлассОбъекта = ПолучитьКлассОбъекта(СтрокаФайла.Объект);
		Если (СтрСравнить(КлассОбъекта, "Форма") <> 0)
		   И (СтрСравнить(КлассОбъекта, "ОбщаяФорма") <> 0) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьОбъектаАнгл = ПолучитьПутьОбъектаИзФайлаВыгрузкиXML(СтрокаФайла.ПолноеИмяФайла,, "ИмяАнглМнФормы");
		ПутьОбъектаАнгл = СтрЗаменить(ПутьОбъектаАнгл, ".", "\");
		
		ПолноеИмяФайлаФормы = КаталогВыгрузкиРезультат + ПутьОбъектаАнгл + "\Ext\Form.xml";
		Если апк_ФайлСуществует(ПолноеИмяФайлаФормы) Тогда
			СтрокаФайла.ПолноеИмяФайла = ПолноеИмяФайлаФормы;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьФайлыКорняКонфигурацииИзТаблицыИзмененныхФайлов(ТаблицаФайлов)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Объект", "Конфигурация");
	
	МассивФайловКонфигурации = ТаблицаФайлов.НайтиСтроки(СтруктураОтбора);
	Если МассивФайловКонфигурации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим все файлы корня конфигурации из таблицы, т.к. они были загружены ранее.
	Для Каждого СтрокаФайла Из МассивФайловКонфигурации Цикл
		ТаблицаФайлов.Удалить(СтрокаФайла);
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиФайловXML()
	
	ТаблицаФайлов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаменитьПутиФайловФормВТаблицеИзмененныхФайлов(ТаблицаФайлов);
	УдалитьФайлыКорняКонфигурацииИзТаблицыИзмененныхФайлов(ТаблицаФайлов);
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаФайлов.Свернуть("ПолноеИмяФайла");
	
	СписокФайловДляЗагрузкиXML = ПолучитьИмяВременногоФайла("txt");
	ДокументТекст = Новый ТекстовыйДокумент;
	
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		ДокументТекст.ДобавитьСтроку(СтрокаФайла.ПолноеИмяФайла);
	КонецЦикла;
	
	ДокументТекст.Записать(СписокФайловДляЗагрузкиXML);
	
	Возврат СписокФайловДляЗагрузкиXML;
	
КонецФункции

Функция ПодготовитьФайлКонфигурацииДляЗагрузкиФайловXML(КаталогЗагрузки = "")
	
	ТаблицаФайлов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Если изменен один из файлов корня конфигурации, то будем загружать их все вместе, но отдельно от файлов всех
	// остальных объектов.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Объект", "Конфигурация");
	
	МассивФайловКонфигурации = ТаблицаФайлов.НайтиСтроки(СтруктураОтбора);
	Если МассивФайловКонфигурации.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураОтбора.Вставить("Изменен", Истина);
	
	// Скопируем все файлы корня конфигурации в отдельный каталог.
	КаталогЗагрузки = ПолучитьИмяВременногоФайла("");
	КаталогДобавитьСлэш(КаталогЗагрузки);
	СоздатьКаталог(КаталогЗагрузки);
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*");
	Для Каждого Файл Из МассивФайлов Цикл
		// Каталоги пропускаем, копируем только файлы в каталоге выгрузки.
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяФайлаИсточника = Файл.ПолноеИмя;
		ИмяФайлаПриемника = СтрЗаменить(ИмяФайлаИсточника, КаталогВыгрузкиРезультат, КаталогЗагрузки);
		КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
	КонецЦикла;
	
	// Скопируем также каталог "Ext", содержащий файлы корня конфигурации, из каталога выгрузки файлов XML.
	КаталогВыгрузкиExt = КаталогВыгрузкиРезультат + "Ext\";
	Если апк_ФайлСуществует(КаталогВыгрузкиExt) Тогда
		КаталогЗагрузкиExt = КаталогЗагрузки + "Ext\";
		СоздатьКаталог(КаталогЗагрузкиExt);
		апк_КаталогКопировать(КаталогВыгрузкиExt, КаталогЗагрузкиExt);
	КонецЕсли;
	
	СписокФайловДляЗагрузкиXML = ПолучитьИмяВременногоФайла("txt");
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.ДобавитьСтроку(КаталогЗагрузки + "Configuration.xml");
	
	ДокументТекст.Записать(СписокФайловДляЗагрузкиXML);
	
	Возврат СписокФайловДляЗагрузкиXML;
	
КонецФункции

Функция ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиВХранилище()
	
	ТекстОшибки = "";
	Если ПустаяСтрока(СписокИзмененныхОбъектов) Тогда
		СписокИзмененныхОбъектов = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли;
	
	апк_ФайлУдалить(СписокИзмененныхОбъектов);
	
	ТаблицаИзмененныхОбъектов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	ТаблицаИзмененныхОбъектов.Свернуть("Объект");
	
	Попытка
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(СписокИзмененныхОбъектов);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента(НСтр("ru='Objects'"));
		ЗаписьXML.ЗаписатьАтрибут("xmlns", "http://v8.1c.ru/8.3/config/objects");
		ЗаписьXML.ЗаписатьАтрибут("version", "1.0");
		
		Для Каждого СтрокаТаблицы Из ТаблицаИзмененныхОбъектов Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Object");
			
			ЗаписьXML.ЗаписатьАтрибут("fullName", СтрокаТаблицы.Объект);
			ЗаписьXML.ЗаписатьАтрибут("includeChildObjects", "false");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();
		
	Исключение
		
		Событие = НСтр("ru='Обработка автоформатирования и локализации.Список измененных объектов'", Метаданные.ОсновнойЯзык.КодЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось записать файл XML со списком измененных объектов ""%1"" по причине:
			|%2'"), СписокИзмененныхОбъектов, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие,,,, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ТаблицаТиповОбъектовИнициализировать()
	
	Если ТаблицаТиповОбъектов <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТиповОбъектов = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектов.Колонки.Добавить("Группа");
	ТаблицаТиповОбъектов.Колонки.Добавить("Имя");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяМнФормы");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяАнгл");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяАнглМнФормы");
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Constant";
	СтрокаТипаОбъекта.Имя = "Константа";
	СтрокаТипаОбъекта.ИмяМнФормы = "Константы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Constants";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Catalog";
	СтрокаТипаОбъекта.Имя = "Справочник";
	СтрокаТипаОбъекта.ИмяМнФормы = "Справочники";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Catalogs";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Document";
	СтрокаТипаОбъекта.Имя = "Документ";
	СтрокаТипаОбъекта.ИмяМнФормы = "Документы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Documents";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DocumentJournal";
	СтрокаТипаОбъекта.Имя = "ЖурналДокументов";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЖурналыДокументов";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DocumentJournals";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Enum";
	СтрокаТипаОбъекта.Имя = "Перечисление";
	СтрокаТипаОбъекта.ИмяМнФормы = "Перечисления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Enums";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Report";
	СтрокаТипаОбъекта.Имя = "Отчет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Отчеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Reports";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DataProcessor";
	СтрокаТипаОбъекта.Имя = "Обработка";
	СтрокаТипаОбъекта.ИмяМнФормы = "Обработки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DataProcessors";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfCharacteristicTypes";
	СтрокаТипаОбъекта.Имя = "ПланВидовХарактеристик";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыВидовХарактеристик";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfCharacteristicTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfAccounts";
	СтрокаТипаОбъекта.Имя = "ПланСчетов";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыСчетов";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfAccounts";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ПланВидовРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыВидовРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfCalculationTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "InformationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрСведений";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыСведений";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "InformationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccumulationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрНакопления";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыНакопления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AccumulationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccountingRegister";
	СтрокаТипаОбъекта.Имя = "РегистрБухгалтерии";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыБухгалтерии";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AccountingRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CalculationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CalculationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BusinessProcess";
	СтрокаТипаОбъекта.Имя = "БизнесПроцесс";
	СтрокаТипаОбъекта.ИмяМнФормы = "БизнесПроцессы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "BusinessProcesses";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Task";
	СтрокаТипаОбъекта.Имя = "Задача";
	СтрокаТипаОбъекта.ИмяМнФормы = "Задачи";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Tasks";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Form";
	СтрокаТипаОбъекта.Имя = "Форма";
	СтрокаТипаОбъекта.ИмяМнФормы = "Формы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Forms";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Attribute";
	СтрокаТипаОбъекта.Имя = "Реквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "Реквизиты";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "ExchangePlan";
	СтрокаТипаОбъекта.Имя = "ПланОбмена";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыОбмена";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExchangePlans";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Characteristic";
	СтрокаТипаОбъекта.Имя = "Характеристика";
	СтрокаТипаОбъекта.ИмяМнФормы = "Характеристика";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Sequence";
	СтрокаТипаОбъекта.Имя = "Последовательность";
	СтрокаТипаОбъекта.ИмяМнФормы = "Последовательности";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Recalculation";
	СтрокаТипаОбъекта.Имя = "Перерасчет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Перерасчеты";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Dimension";
	СтрокаТипаОбъекта.Имя = "Измерение";
	СтрокаТипаОбъекта.ИмяМнФормы = "Измерения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Resource";
	СтрокаТипаОбъекта.Имя = "Ресурс";
	СтрокаТипаОбъекта.ИмяМнФормы = "Ресурсы";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "TabularSection";
	СтрокаТипаОбъекта.Имя = "ТабличнаяЧасть";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТабличныеЧасти";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Attribute";
	СтрокаТипаОбъекта.Имя = "Реквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "РеквизитыТабличнойЧасти";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Command";
	СтрокаТипаОбъекта.Имя = "Команда";
	СтрокаТипаОбъекта.ИмяМнФормы = "Команды";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Role";
	СтрокаТипаОбъекта.Имя = "Роль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Роли";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Roles";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "SessionParameter";
	СтрокаТипаОбъекта.Имя = "ПараметрСеанса";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПараметрыСеанса";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SessionParameters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonModule";
	СтрокаТипаОбъекта.Имя = "ОбщийМодуль";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеМодули";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonModules";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FilterCriterion";
	СтрокаТипаОбъекта.Имя = "КритерийОтбора";
	СтрокаТипаОбъекта.ИмяМнФормы = "КритерииОтбора";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FilterCriteria";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "EventSubscription";
	СтрокаТипаОбъекта.Имя = "ПодпискаНаСобытие";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПодпискиНаСобытия";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "EventSubscriptions";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "ScheduledJob";
	СтрокаТипаОбъекта.Имя = "РегламентноеЗадание";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегламентныеЗадания";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ScheduledJobs";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "SettingsStorage";
	СтрокаТипаОбъекта.Имя = "ХранилищеНастроек";
	СтрокаТипаОбъекта.ИмяМнФормы = "ХранилищаНастроек";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SettingsStorages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonForm";
	СтрокаТипаОбъекта.Имя = "ОбщаяФорма";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеФормы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonForms";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonCommand";
	СтрокаТипаОбъекта.Имя = "ОбщаяКоманда";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеКоманды";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonCommands";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommandGroup";
	СтрокаТипаОбъекта.Имя = "ГруппаКоманд";
	СтрокаТипаОбъекта.ИмяМнФормы = "ГруппыКоманд";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommandGroups";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Interface";
	СтрокаТипаОбъекта.Имя = "Интерфейс";
	СтрокаТипаОбъекта.ИмяМнФормы = "Интерфейсы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Interfaces";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonTemplate";
	СтрокаТипаОбъекта.Имя = "ОбщийМакет";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеМакеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonTemplates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonPicture";
	СтрокаТипаОбъекта.Имя = "ОбщаяКартинка";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеКартинки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonPictures";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "XDTOPackage";
	СтрокаТипаОбъекта.Имя = "ПакетXDTO";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПакетыXDTO";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "XDTOPackages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "WebService";
	СтрокаТипаОбъекта.Имя = "WebСервис";
	СтрокаТипаОбъекта.ИмяМнФормы = "WebСервисы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "WebServices";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "HTTPService";
	СтрокаТипаОбъекта.Имя = "HTTPСервис";
	СтрокаТипаОбъекта.ИмяМнФормы = "HTTPСервисы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "HTTPServices";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Style";
	СтрокаТипаОбъекта.Имя = "Стиль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Стили";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Styles";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "StyleItem";
	СтрокаТипаОбъекта.Имя = "ЭлементСтиля";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭлементыСтиля";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StyleItems";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DocumentNumerator";
	СтрокаТипаОбъекта.Имя = "НумераторДокументов";
	СтрокаТипаОбъекта.ИмяМнФормы = "НумераторыДокументов";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AddressingAttribute";
	СтрокаТипаОбъекта.Имя = "РеквизитАдресации";
	СтрокаТипаОбъекта.ИмяМнФормы = "РеквизитыАдресации";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccountingFlag";
	СтрокаТипаОбъекта.Имя = "ПризнакУчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПризнакиУчета";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionAccountingFlag";
	СтрокаТипаОбъекта.Имя = "ПризнакУчетаСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПризнакиУчетаСубконто";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Subsystem";
	СтрокаТипаОбъекта.Имя = "Подсистема";
	СтрокаТипаОбъекта.ИмяМнФормы = "Подсистемы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Subsystems";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "WSReference";
	СтрокаТипаОбъекта.Имя = "WSСсылка";
	СтрокаТипаОбъекта.ИмяМнФормы = "WSСсылки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "WSReferences";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FunctionalOptionsParameter";
	СтрокаТипаОбъекта.Имя = "ПараметрФункциональныхОпций";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПараметрыФункциональныхОпций";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FunctionalOptionsParameters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FunctionalOption";
	СтрокаТипаОбъекта.Имя = "ФункциональнаяОпция";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FunctionalOptions";
	СтрокаТипаОбъекта.ИмяМнФормы = "ФункциональныеОпции";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonAttribute";
	СтрокаТипаОбъекта.Имя = "ОбщийРеквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеРеквизиты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonAttributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Template";
	СтрокаТипаОбъекта.Имя = "Макет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Макеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Templates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Predefined";
	СтрокаТипаОбъекта.Имя = "Предопределенный";
	СтрокаТипаОбъекта.ИмяМнФормы = "Предопределенные";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Configuration";
	СтрокаТипаОбъекта.Имя = "Конфигурация";
	СтрокаТипаОбъекта.ИмяМнФормы = "Конфигурация";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Language";
	СтрокаТипаОбъекта.Имя = "Язык";
	СтрокаТипаОбъекта.ИмяМнФормы = "Языки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Languages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EnumValue";
	СтрокаТипаОбъекта.Имя = "ЗначениеПеречисления";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЗначенияПеречисления";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Column";
	СтрокаТипаОбъекта.Имя = "Графа";
	СтрокаТипаОбъекта.ИмяМнФормы = "Графы";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExternalDataSource";
	СтрокаТипаОбъекта.Имя = "ВнешнийИсточникДанных";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВнешниеИсточникиДанных";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExternalDataSources";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Table";
	СтрокаТипаОбъекта.Имя = "Таблица";
	СтрокаТипаОбъекта.ИмяМнФормы = "Таблицы";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Field";
	СтрокаТипаОбъекта.Имя = "Поле";
	СтрокаТипаОбъекта.ИмяМнФормы = "Поля";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Operation";
	СтрокаТипаОбъекта.Имя = "Операция";
	СтрокаТипаОбъекта.ИмяМнФормы = "Операции";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Parameter";
	СтрокаТипаОбъекта.Имя = "Параметр";
	СтрокаТипаОбъекта.ИмяМнФормы = "Параметры";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "URLTemplate";
	СтрокаТипаОбъекта.Имя = "ШаблонURL";
	СтрокаТипаОбъекта.ИмяМнФормы = "ШаблоныURL";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Method";
	СтрокаТипаОбъекта.Имя = "МетодШаблонаURL";
	СтрокаТипаОбъекта.ИмяМнФормы = "МетодыШаблонаURL";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Aggregate";
	СтрокаТипаОбъекта.Имя = "Агрегат";
	СтрокаТипаОбъекта.ИмяМнФормы = "Агрегаты";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "DefinedType";
	СтрокаТипаОбъекта.Имя = "ОпределяемыйТип";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОпределяемыеТипы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DefinedTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "StandardTabularSection";
	СтрокаТипаОбъекта.Имя = "СтандартнаяТабличнаяЧасть";
	СтрокаТипаОбъекта.ИмяМнФормы = "СтандартныеТабличныеЧасти";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StandardTabularSections";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "StandardAttribute";
	СтрокаТипаОбъекта.Имя = "СтандартныйРеквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "СтандартныеРеквизиты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StandardAttributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Ref";
	СтрокаТипаОбъекта.Имя = "Ссылка";
	СтрокаТипаОбъекта.ИмяМнФормы = "Ссылка";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DeletionMark";
	СтрокаТипаОбъекта.Имя = "ПометкаУдаления";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПометкаУдаления";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Predefined";
	СтрокаТипаОбъекта.Имя = "Предопределенный";
	СтрокаТипаОбъекта.ИмяМнФормы = "Предопределенные";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "PredefinedDataName";
	СтрокаТипаОбъекта.Имя = "ИмяПредопределенныхДанных";
	СтрокаТипаОбъекта.ИмяМнФормы = "ИмяПредопределенныхДанных";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Date";
	СтрокаТипаОбъекта.Имя = "Дата";
	СтрокаТипаОбъекта.ИмяМнФормы = "Дата";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Number";
	СтрокаТипаОбъекта.Имя = "Номер";
	СтрокаТипаОбъекта.ИмяМнФормы = "Номер";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Posted";
	СтрокаТипаОбъекта.Имя = "Проведен";
	СтрокаТипаОбъекта.ИмяМнФормы = "Проведен";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "LineNumber";
	СтрокаТипаОбъекта.Имя = "НомерСтроки";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерСтроки";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Code";
	СтрокаТипаОбъекта.Имя = "Код";
	СтрокаТипаОбъекта.ИмяМнФормы = "Код";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Description";
	СтрокаТипаОбъекта.Имя = "Наименование";
	СтрокаТипаОбъекта.ИмяМнФормы = "Наименование";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Parent";
	СтрокаТипаОбъекта.Имя = "Родитель";
	СтрокаТипаОбъекта.ИмяМнФормы = "Родитель";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Owner";
	СтрокаТипаОбъекта.Имя = "Владелец";
	СтрокаТипаОбъекта.ИмяМнФормы = "Владелец";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "IsFolder";
	СтрокаТипаОбъекта.Имя = "ЭтоГруппа";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭтоГруппа";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Order";
	СтрокаТипаОбъекта.Имя = "Порядок";
	СтрокаТипаОбъекта.ИмяМнФормы = "Порядок";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ThisNode";
	СтрокаТипаОбъекта.Имя = "ЭтотУзел";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭтотУзел";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "OffBalance";
	СтрокаТипаОбъекта.Имя = "Забалансовый";
	СтрокаТипаОбъекта.ИмяМнФормы = "Забалансовый";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Executed";
	СтрокаТипаОбъекта.Имя = "Выполнена";
	СтрокаТипаОбъекта.ИмяМнФормы = "Выполнена";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RoutePoint";
	СтрокаТипаОбъекта.Имя = "ТочкаМаршрута";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТочкаМаршрута";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Recorder";
	СтрокаТипаОбъекта.Имя = "Регистратор";
	СтрокаТипаОбъекта.ИмяМнФормы = "Регистратор";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CalculationType";
	СтрокаТипаОбъекта.Имя = "ВидРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидРасчета";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействия";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействия";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BegOfActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействияНачало";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияНачало";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EndOfActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействияКонец";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияКонец";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BegOfBasePeriod";
	СтрокаТипаОбъекта.Имя = "БазовыйПериодНачало";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыйПериодНачало";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EndOfBasePeriod";
	СтрокаТипаОбъекта.Имя = "БазовыйПериодКонец";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыйПериодКонец";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Active";
	СтрокаТипаОбъекта.Имя = "Активность";
	СтрокаТипаОбъекта.ИмяМнФормы = "Активность";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ReversingEntry";
	СтрокаТипаОбъекта.Имя = "Сторно";
	СтрокаТипаОбъекта.ИмяМнФормы = "Сторно";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RegistrationPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодРегистрации";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодРегистрации";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "SentNo";
	СтрокаТипаОбъекта.Имя = "НомерОтправленного";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерОтправленного";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ReceivedNo";
	СтрокаТипаОбъекта.Имя = "НомерПринятого";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерПринятого";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Account";
	СтрокаТипаОбъекта.Имя = "Счет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Счет";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RecordType";
	СтрокаТипаОбъекта.Имя = "ВидДвижения";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидДвижения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Period";
	СтрокаТипаОбъекта.Имя = "Период";
	СтрокаТипаОбъекта.ИмяМнФормы = "Период";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Started";
	СтрокаТипаОбъекта.Имя = "Стартован";
	СтрокаТипаОбъекта.ИмяМнФормы = "Стартован";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "HeadTask";
	СтрокаТипаОбъекта.Имя = "ВедущаяЗадача";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВедущаяЗадача";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Completed";
	СтрокаТипаОбъекта.Имя = "Завершен";
	СтрокаТипаОбъекта.ИмяМнФормы = "Завершен";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ActionPeriodIsBasic";
	СтрокаТипаОбъекта.Имя = "ПериодДействияБазовый";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияБазовый";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ValueType";
	СтрокаТипаОбъекта.Имя = "ТипЗначения";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТипЗначения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Type";
	СтрокаТипаОбъекта.Имя = "Тип";
	СтрокаТипаОбъекта.ИмяМнФормы = "Тип";// - ЖурналДокументов
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Type";
	СтрокаТипаОбъекта.Имя = "Вид";
	СтрокаТипаОбъекта.ИмяМнФормы = "Вид";// - ПланСчетов
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionTypes";
	СтрокаТипаОбъекта.Имя = "ВидыСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидыСубконто";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "TurnoversOnly";
	СтрокаТипаОбъекта.Имя = "ТолькоОбороты";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТолькоОбороты";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionType";
	СтрокаТипаОбъекта.Имя = "ВидСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидСубконто";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BaseCalculationTypes";
	СтрокаТипаОбъекта.Имя = "БазовыеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыеВидыРасчета";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DisplacingCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ВытесняющиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВытесняющиеВидыРасчета";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "LeadingCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ВедущиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВедущиеВидыРасчета";
	
	// Модули
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Module";
	СтрокаТипаОбъекта.Имя = "Модуль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Модуль";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CommandModule";
	СтрокаТипаОбъекта.Имя = "МодульКоманды";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульКоманды";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ObjectModule";
	СтрокаТипаОбъекта.Имя = "МодульОбъекта";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульОбъекта";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ManagerModule";
	СтрокаТипаОбъекта.Имя = "МодульМенеджера";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульМенеджера";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RecordSetModule";
	СтрокаТипаОбъекта.Имя = "МодульНабораЗаписей";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульНабораЗаписей";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ValueManagerModule";
	СтрокаТипаОбъекта.Имя = "МодульМенеджераЗначения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульМенеджераЗначения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульПриложения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ManagedApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульУправляемогоПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульУправляемогоПриложения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "SessionModule";
	СтрокаТипаОбъекта.Имя = "МодульСеанса";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульСеанса";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExternalConnectionModule";
	СтрокаТипаОбъекта.Имя = "МодульВнешнегоСоединения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульВнешнегоСоединения";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "OrdinaryApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульОбычногоПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульОбычногоПриложения";
	
	// Права
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Rights";
	СтрокаТипаОбъекта.Имя = "Право";
	СтрокаТипаОбъекта.ИмяМнФормы = "Права";
	
	ТаблицаТиповОбъектов.Индексы.Добавить("ИмяАнгл");
	ТаблицаТиповОбъектов.Индексы.Добавить("Имя");
	ТаблицаТиповОбъектов.Индексы.Добавить("ИмяМнФормы");
	
КонецПроцедуры

Функция ПолучитьТипОбъектаПоТаблицеТипов(ЗначениеПоиска, КолонкаПоиска = "ИмяАнгл", КолонкаИмени = "Имя", ЗначениеПоУмолчанию = Неопределено)
	
	СтандартныйТип = ТаблицаТиповОбъектов.Найти(ЗначениеПоиска, КолонкаПоиска);
	Возврат ?(СтандартныйТип = Неопределено,
		?(ЗначениеПоУмолчанию = Неопределено, ЗначениеПоиска, ЗначениеПоУмолчанию),
		СтандартныйТип[КолонкаИмени]);
	
КонецФункции

Функция ПолучитьКлассОбъекта(ПутьОбъекта, Разделитель = ".")
	
	МассивПути = СтрРазделить(ПутьОбъекта, Разделитель, Ложь);
	КоличествоЭлементовПути = МассивПути.Количество();
	
	Если КоличествоЭлементовПути = 0 Тогда
		Возврат "";
	ИначеЕсли КоличествоЭлементовПути <= 2 Тогда
		НомерЭлемента = 0;
	Иначе
		НомерЭлемента = 2;
	КонецЕсли;
	
	Возврат МассивПути[НомерЭлемента];
	
КонецФункции

Функция ПолучитьПутьОбъектаИзФайлаВыгрузкиXML(ФайлВыгрузкиXML, Разделитель = ".", КолонкаИмени = "Имя")
	
	ТаблицаТиповОбъектовИнициализировать();
	
	// Получим имя файла без расширения.
	ИмяОбъекта = ФайлВыгрузкиXML;
	// Удаляем каталог выгрузки из пути объекта.
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, КаталогВыгрузкиРезультат, "");
	// Очищаем каталог "Ext" из пути объекта
	Если СтрНачинаетсяС(ИмяОбъекта, "Ext\") Тогда
		// Для файлов конфигурации, например "Configuration.xml", каталог "Ext" лежит в корне каталога выгрузки,
		// удалим его из начала пути, взяв оставшуюся часть по длине строки "Ext\".
		ИмяОбъекта = Сред(ИмяОбъекта, СтрДлина("Ext\") + 1);
	Иначе
		// Для файлов всех остальных объектов очистим каталог "Ext" заменой на "\".
		ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "\Ext\", "\");
	КонецЕсли;
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "\", Разделитель);
	ИмяОбъекта = ПолучитьИмяФайлаБезРасширения(ИмяОбъекта);
	
	МассивПутиАнгл = СтрРазделить(ИмяОбъекта, Разделитель, Ложь);
	КоличествоЭлементовПутиАнгл = МассивПутиАнгл.Количество();
	
	// Для файлов конфигурации, лежащих в самом каталоге выгрузки, задаем имя объекта как "Конфигурация" (или "Configuration").
	Если КоличествоЭлементовПутиАнгл < 2 Тогда
		Возврат ПолучитьТипОбъектаПоТаблицеТипов("Конфигурация", "Имя", КолонкаИмени);
	КонецЕсли;
	
	ПутьФактический = "";
	
	// Для общих форм всегда берем 2 элемента пути, т.к. в пути к модулю будет 4 элемента пути, и объект определяется неправильно.
	Если СтрСравнить(МассивПутиАнгл[0], "CommonForms") = 0 Тогда
		КоличествоЭлементов = 2;
	Иначе
		КоличествоЭлементов = ?(КоличествоЭлементовПутиАнгл < 4, 2, 4);
	КонецЕсли;
	
	МассивПути = Новый Массив;
	Для Счетчик = 1 По КоличествоЭлементов Цикл
		
		ЭлементПути = МассивПутиАнгл[Счетчик - 1];
		// Если элемент пути стоит на нечетном месте (нумерация с 1) в имени файла,
		// то ищем его эквивалент на русском языке в единственном числе.
		Если Счетчик % 2 = 1 Тогда
			ЭлементПути = ПолучитьТипОбъектаПоТаблицеТипов(ЭлементПути, "ИмяАнглМнФормы", КолонкаИмени);
		КонецЕсли;
		
		// Четные элементы пути оставляем как есть - это наименования объектов метаданных.
		МассивПути.Добавить(ЭлементПути);
		
	КонецЦикла;
	
	ПутьФактический = СтрСоединить(МассивПути, Разделитель);
	
	Возврат ПутьФактический;
	
КонецФункции

#КонецОбласти

#Область КомандыЗапускаКонфигуратораВПакетномРежиме

// Функция запускает проверяемую конфигурацию в режиме конфигуратора,
// подключается к хранилищу, обновляется из него и обновляет информационную базу.
//
Функция ЗагрузитьКонфигурациюИзХранилища() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryUpdateCfg -revised -force"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда 
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	ФайлЛога = Новый ТекстовыйДокумент;
	ФайлЛога.Прочитать(ИмяФайлаЛога);
	ТекстЛога = ФайлЛога.ПолучитьТекст();
	
	апк_ФайлУдалить(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора и подключается к хранилищу.
//
Функция ПодключитьКонфигурациюКХранилищу() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryBindCfg -forceBindAlreadyBindedUser -forceReplaceCfg"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	// Подключение прошло успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Подключение прошло с ошибкой, возвращаем текст ошибки.
	ТекстЛога = апк_ФайлПолучитьТекст(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора и захватывает все объекты в хранилище.
//
Функция ЗахватитьОбъектыКонфигурацииВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryLock -revised"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	// Код возврата в данном случае не анализируем, т.к. он будет отличен от 0,
	// даже если хотя бы один объект захватить не удалось.
	ЗапуститьПриложение(КоманднаяСтрока,, Истина);
	
	// Заполняем таблицу захваченных объектов.
	Статус = ЗаполнитьТаблицуЗахваченныхОбъектов(ИмяФайлаЛога);
	
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить файлы XML.
// Возвращает пустую строку, если выгрузка удачна, иначе лог выгрузки.
//
Функция ВыгрузитьКонфигурациюВФайлыXML() Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	СоздатьКаталог(КаталогВыгрузки);
	СоздатьКаталог(КаталогВыгрузкиРезультат);
	
	// Выгружаем конфигурацию в файлы xml.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"" /DumpConfigToFiles ""%5"" /Out ""%6"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	Статус = ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога);
	Возврат Статус;
	
КонецФункции

// Выполняет частичную загрузку файлов XML.
//
Функция ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогЗагрузки, СписокФайловДляЗагрузкиXML)
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	// Загружаем конфигурацию из файлов xml.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"" /LoadConfigFromFiles ""%5"" -listFile ""%6"" /Out ""%7"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогЗагрузки,
		СписокФайловДляЗагрузкиXML,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда 
		апк_ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	Статус = ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога);
	
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы загрузить файлы XML.
//
Функция ЗагрузитьКонфигурациюИзФайловXML() Экспорт
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	Статус = ЗагрузитьКореньКонфигурацииИзФайловXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Статус = ЗагрузитьОбъектыКонфигурацииИзФайловXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗагрузитьКореньКонфигурацииИзФайловXML()
	
	// Подготовим отдельно файл конфигурации для загрузки.
	КаталогЗагрузки = "";
	СписокФайловДляЗагрузкиXML = ПодготовитьФайлКонфигурацииДляЗагрузкиФайловXML(КаталогЗагрузки);
	Если ПустаяСтрока(СписокФайловДляЗагрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	Статус = ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогЗагрузки, СписокФайловДляЗагрузкиXML);
	
	апк_ФайлУдалить(КаталогЗагрузки);
	апк_ФайлУдалить(СписокФайловДляЗагрузкиXML);
	
	Возврат Статус;
	
КонецФункции

Функция ЗагрузитьОбъектыКонфигурацииИзФайловXML()
	
	// Подготовим файл измененных объектов XML, которые нужно загрузить в конфигурацию.
	СписокФайловДляЗагрузкиXML = ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиФайловXML();
	Если ПустаяСтрока(СписокФайловДляЗагрузкиXML) Тогда
		// Если измененных файлов нет, то вернется пустая строка. Загружать нечего, выходим.
		Возврат "";
	КонецЕсли;
	
	Статус = ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогВыгрузкиРезультат, СписокФайловДляЗагрузкиXML);
	
	апк_ФайлУдалить(СписокФайловДляЗагрузкиXML);
	
	Возврат Статус;
	
КонецФункции

Функция ОбновитьКонфигурациюБД() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	КлючСервер = "";
	Если ТипИсточника = 1 Тогда
		КлючСервер = " -Server";
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе) 
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /UpdateDBCfg " + КлючСервер
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда 
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	ТекстЛога = ПолучитьЛогВыгрузкиФайловКонфигурации(ИмяФайлаЛога);
	
	Возврат ?(СтрНайти(ТекстЛога, Нстр("ru = 'Обновление конфигурации успешно завершено'")) > 0, "", ТекстЛога);
	
КонецФункции

Функция ПоместитьИзмененныеОбъектыВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	Статус = ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиВХранилище();
	Если НЕ ПустаяСтрока(Статус) Тогда
		// При создании файла произошла ошибка, возвращаем текст ошибки.
		Возврат Статус;
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СписокИзмененныхОбъектов) Тогда
		// Файла не существует, значит, нет измененных объектов для помещения в хранилище, выходим.
		Возврат "";
	КонецЕсли;
	
	// Поместим только захваченные измененные объекты в хранилище.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"""
		+ " /ConfigurationRepositoryF ""%5"""
		+ " /ConfigurationRepositoryN ""%6"""
		+ " /ConfigurationRepositoryP ""%7"""
		+ " /ConfigurationRepositoryCommit -objects ""%8"" -comment ""%9"""
		+ " /Out ""%10"""
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогХранилища,
		ПользовательХранилища,
		ПарольХранилища,
		СписокИзмененныхОбъектов,
		ТекстКомментария,
		ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	// Помещение объектов прошло успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Помещение объектов прошло с ошибкой, возвращаем текст ошибки.
	ТекстЛога = апк_ФайлПолучитьТекст(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

Функция ОтменитьЗахватОбъектовВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда 
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда 
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:'") + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	// Отменим захваченные объекты в хранилище.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"""
		+ " /ConfigurationRepositoryF ""%5"""
		+ " /ConfigurationRepositoryN ""%6"""
		+ " /ConfigurationRepositoryP ""%7"""
		+ " /ConfigurationRepositoryUnlock -force"
		+ " /Out ""%8"""
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогХранилища,
		ПользовательХранилища,
		ПарольХранилища,
		ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	// Отмена захвата объектов прошла успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Отмена захвата объектов завершилась с ошибкой, возвращаем текст ошибки.
	ТекстЛога = апк_ФайлПолучитьТекст(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает "Истина", если ПредыдущийРелиз меньше СледующийРелиз.
//
Функция апк_РелизыПоПорядку(ПредыдущийРелиз, СледующийРелиз)
	
	Если ПустаяСтрока(ПредыдущийРелиз) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПредыдущийРелиз = СледующийРелиз Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивЧиселПредыдущегоРелиза = СтрРазделить(ПредыдущийРелиз, ".", Ложь);
	МассивЧиселСледующегоРелиза = СтрРазделить(СледующийРелиз, ".", Ложь);
	
	КоличествоЧиселПредыдущегоРелиза = МассивЧиселПредыдущегоРелиза.Количество();
	Если КоличествоЧиселПредыдущегоРелиза <> МассивЧиселСледующегоРелиза.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для НомерЭлемента = 0 По КоличествоЧиселПредыдущегоРелиза - 1 Цикл
		ЧислоПредыдущего = Число(МассивЧиселПредыдущегоРелиза[НомерЭлемента]);
		ЧислоСледующего = Число(МассивЧиселСледующегоРелиза[НомерЭлемента]);
		Если ЧислоПредыдущего <> ЧислоСледующего Тогда
			Возврат (ЧислоСледующего > ЧислоПредыдущего);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьПлатформу836() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
	
	Если апк_РелизыПоПорядку("8.3.6.0", ВерсияПриложения) Тогда
		Возврат "";
	КонецЕсли;
	
	Синоним = Метаданные().Синоним;
	
	Статус = НСтр("ru='Для запуска внешней обработки ""%1"" необходима версия платформы не меньше, чем 8.3.6.
		|Текущая версия %2'");
	Статус = СтрШаблон(Статус, Синоним, ВерсияПриложения);
	
	Возврат Статус;
	
КонецФункции

Функция ЗаполнитьТаблицуЗахваченныхОбъектов(ФайлЗахваченныхОбъектов, УдалитьФайл = Истина)
	
	ЗахваченныеОбъекты.Очистить();
	
	Если НЕ апк_ФайлСуществует(ФайлЗахваченныхОбъектов) Тогда
		ТекстОшибки = НСтр("ru='Не найден файл захваченных объектов, указанный по пути:'")
			+ Символы.ПС + ФайлЗахваченныхОбъектов;
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Получаем лог захваченных объектов.
	ТекстФайлаЗахваченныхОбъектов = апк_ФайлПолучитьТекст(ФайлЗахваченныхОбъектов, УдалитьФайл);
	
	// Анализируем лог захвата объектов.
	ТекстНачалоОперации = НСтр("ru='---- Начало операции с хранилищем конфигурации ----'");
	Если СтрНайти(ТекстФайлаЗахваченныхОбъектов, ТекстНачалоОперации) = 0 Тогда
		// Если такой фразы в логе нет, значит, произошла ошибка, возвращаем текст ошибки.
		Возврат ТекстФайлаЗахваченныхОбъектов;
	КонецЕсли;
	
	ТекстОбъектЗахваченУспешно = НСтр("ru='Объект захвачен для редактирования:'");
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстФайлаЗахваченныхОбъектов);
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаТекста = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		// Пытаемся получить объект из строки лога.
		ПозицияПоиска = СтрНайти(СтрокаТекста, ":");
		Если ПозицияПоиска = 0 Тогда
			// Если в строке нет двоеточия, это не строка с объектом, пропускаем.
			Продолжить;
		КонецЕсли;
		
		ПутьОбъекта = Сред(СтрокаТекста, ПозицияПоиска + 1);
		
		// Если объект захвачен другим пользователем, то в конце строки будет имя пользователя в скобках, удаляем.
		ПозицияПоиска = СтрНайти(ПутьОбъекта, "(");
		Если ПозицияПоиска > 0 Тогда
			ПутьОбъекта = Лев(ПутьОбъекта, ПозицияПоиска - 1);
		КонецЕсли;
		
		ПутьОбъекта = СокрЛП(ПутьОбъекта);
		// Если в пути к объекту остались пробелы, значит, это не объект, пропускаем.
		Если СтрНайти(ПутьОбъекта, " ") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектЗахваченУспешно = СтрНачинаетсяС(СтрокаТекста, ТекстОбъектЗахваченУспешно);
		
		// Если в пути к объекту нет точек, тогда это корень конфигурации, переименуем его.
		Если СтрНайти(ПутьОбъекта, ".") = 0 Тогда
			ПутьОбъекта = "Конфигурация";
		КонецЕсли;
		
		НовыйОбъект = ЗахваченныеОбъекты.Добавить();
		НовыйОбъект.Объект = ПутьОбъекта;
		НовыйОбъект.ЗахваченДляРедактирования = ОбъектЗахваченУспешно;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьСтатусЗахватаОбъектаВХранилище(ПутьОбъекта)
	
	// Если не указана ни одна настройка, связанная с хранилищем, то предполагаем, что объект по умолчанию захвачен.
	Если ПустаяСтрока(КаталогХранилища)
	   И ПустаяСтрока(СписокИзмененныхОбъектов)
	   И (НЕ ПомещатьИзмененныеОбъектыВХранилище) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЗахваченВХранилище = Ложь;
	
	// Иначе определяем статус захвата объекта в таблице захваченных объектов.
	СтрокаЗахваченногоОбъекта = ЗахваченныеОбъекты.Найти(ПутьОбъекта, "Объект");
	Если (СтрокаЗахваченногоОбъекта = Неопределено) Тогда
		ЗахваченВХранилище = ПолучитьСтатусЗахватаРодителяОбъектаВХранилище(ПутьОбъекта);
	Иначе
		ЗахваченВХранилище = СтрокаЗахваченногоОбъекта.ЗахваченДляРедактирования;
	КонецЕсли;
	
	Возврат ЗахваченВХранилище;
	
КонецФункции

Функция ПолучитьСтатусЗахватаРодителяОбъектаВХранилище(ПутьОбъекта)
	
	// Некоторые объекты, например, команды, нельзя захватить в хранилище.
	// Для них получим состояние родительского объекта.
	МассивЭлементовПути = СтрРазделить(ПутьОбъекта, ".", Ложь);
	Если МассивЭлементовПути.Количество() < 2 Тогда
		// У объекта нет родительского объекта, выходим.
		Возврат Ложь;
	КонецЕсли;
	
	НомерПоследнегоЭлемента = МассивЭлементовПути.ВГраница();
	НомерПредпоследнегоЭлемента = НомерПоследнегоЭлемента - 1;
	
	// Получаем наименование предпоследнего элемента.
	ПредпоследнийЭлемент = МассивЭлементовПути[НомерПредпоследнегоЭлемента];
	Если СтрСравнить(ПредпоследнийЭлемент, "Команда") <> 0 Тогда
		// Если не команда, то выходим.
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем последний и предпоследний элемент пути.
	МассивЭлементовПути.Удалить(НомерПоследнегоЭлемента);
	МассивЭлементовПути.Удалить(НомерПредпоследнегоЭлемента);
	
	ОбъектРодителяПуть = СтрСоединить(МассивЭлементовПути, ".");
	
	СтрокаЗахваченногоОбъекта = ЗахваченныеОбъекты.Найти(ОбъектРодителяПуть, "Объект");
	Возврат ?(СтрокаЗахваченногоОбъекта = Неопределено, Ложь, СтрокаЗахваченногоОбъекта.ЗахваченДляРедактирования);
	
КонецФункции

Функция ПрочитатьПравилаПоддержки(ФайлПравилПоддержки)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ФайлПравилПоддержки);
	
	ПараметрыПоддержки = ТекстовыйДокумент.ПолучитьТекст();
	ТекстовыйДокумент = Неопределено;
	ПараметрыПоддержки = СтрРазделить(ПараметрыПоддержки, ",", Ложь);
	
	КоличествоКонфигураций = 0;
	СчетчикКонфигураций = 0;
	КоличествоОбъектов = 0;
	СчетчикОбъектов = 0;
	
	МассивПараметров = Новый Массив;
	
	Если ПараметрыПоддержки.ВГраница() > 2 Тогда
		Попытка
			КоличествоКонфигураций = Число(ПараметрыПоддержки[2]);
		Исключение
			Возврат Неопределено;
		КонецПопытки; 
	КонецЕсли; 
	Если КоличествоКонфигураций = 0  Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ПравилаПоддержки = Новый Соответствие;
	ПравилаПоддержки.Вставить(0, "Не редактируется");
	ПравилаПоддержки.Вставить(1, "Редактируется с сохранением поддержки");
	ПравилаПоддержки.Вставить(2, "Снят с поддержки");
	
	ПравилаПоставки = Новый Соответствие;
	ПравилаПоставки.Вставить(0, "Изменения разрешены");
	ПравилаПоставки.Вставить(1, "Изменения не рекомендуются");
	ПравилаПоставки.Вставить(2, "Изменения запрещены");
	ПравилаПоставки.Вставить(-1, "Включение в конфигурацию не рекомендуется");
	
	Индекс = 3;
	Для СчетчикКонфигураций = 1 По КоличествоКонфигураций Цикл
		
		Поставка = Новый Структура;
		// Начало конфигурации
		Поставка.Вставить("УИД1",ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("Параметр", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("УИД2", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("Версия", СтрЗаменить(ПараметрыПоддержки[Индекс], """", ""));
		Индекс = Индекс + 1;
		Поставка.Вставить("Поставщик", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("КонфигурацияПоставщика", СтрЗаменить(ПараметрыПоддержки[Индекс], """", ""));
		Индекс = Индекс + 1;
		Попытка
			КоличествоОбъектов = Число(ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		МассивОбъектов = Новый Массив;
		Для СчетчикОбъектов = 1 По КоличествоОбъектов Цикл
			Если Индекс + 4 > ПараметрыПоддержки.ВГраница() Тогда
				СчетчикОбъектов = СчетчикОбъектов + 1;
				Прервать;
			КонецЕсли;
			
			НастройкиОбъекта = Новый Структура;
			НастройкиОбъекта.Вставить("ПравилоПоддержки", ПравилаПоддержки.Получить(Число(ПараметрыПоддержки[Индекс])));
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ПравилоПоставки", ПравилаПоставки.Получить(Число(ПараметрыПоддержки[Индекс])));
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ОбъектМетаданных", ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ОбъектПоставщика", ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
			
			МассивОбъектов.Добавить(НастройкиОбъекта);
		КонецЦикла; 
		
		Поставка.Вставить("Объекты", МассивОбъектов);
		
		Индекс = Индекс + 2; // пустые параметры в конце
		
		МассивПараметров.Добавить(Поставка);
	КонецЦикла; 
	
	Возврат МассивПараметров;
	
КонецФункции

Процедура ЗаполнитьПравилаПоддержки() Экспорт
	
	ПравилаПоддержкиОбъектов.Очистить();
	
	ФайлПравилПоддержки = КаталогВыгрузкиРезультат + "Ext\ParentConfigurations.bin";
	
	Если НЕ апк_ФайлСуществует(ФайлПравилПоддержки) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПравилПоддержки = ПрочитатьПравилаПоддержки(ФайлПравилПоддержки);
	Если МассивПравилПоддержки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНеРедактируется = "Не редактируется";
	
	Для Каждого Элемент Из МассивПравилПоддержки Цикл
		
		// Проверяем свойство "Параметр", если он равен 1, то изменения запрещены.
		ИзмененияЗапрещены = (Элемент.Параметр = "1");
		
		Объекты = Элемент.Объекты;
		Для Каждого Объект Из Объекты Цикл
			
			uuidОбъекта = Объект.ОбъектМетаданных;
			
			// Если объекта еще нет в таблице, то добавим его.
			СтрокаТаблицы = ПравилаПоддержкиОбъектов.Найти(uuidОбъекта, "Объект");
			Если СтрокаТаблицы = Неопределено Тогда
				СтрокаТаблицы = ПравилаПоддержкиОбъектов.Добавить();
				СтрокаТаблицы.Объект = uuidОбъекта;
				СтрокаТаблицы.ПравилоПоддержки = ?(ИзмененияЗапрещены, ТекстНеРедактируется, Объект.ПравилоПоддержки);
				
				Продолжить;
			КонецЕсли;
			
			// Если объект уже есть, проверим его правило поддержки.
			Если СтрСравнить(СтрокаТаблицы.ПравилоПоддержки, ТекстНеРедактируется) <> 0 Тогда
				// Если изменения для объекта возможны, то заменяем текущее правило поддержки.
				СтрокаТаблицы.ПравилоПоддержки = Объект.ПравилоПоддержки;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеXDTO(ФайлВыгрузкиXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлВыгрузкиXML);
	
	Данные = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьИмяПодчиненногоОбъектаXDTO(ДанныеПодчиненногоОбъекта)
	
	СвойстваПодчиненногоОбъекта = ДанныеПодчиненногоОбъекта.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("Properties") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеСвойствПодчиненногоОбъекта = ДанныеПодчиненногоОбъекта.Properties;
	
	СвойстваПодчиненногоОбъекта = ДанныеСвойствПодчиненногоОбъекта.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("Name") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ДанныеСвойствПодчиненногоОбъекта.Name;
	
КонецФункции

Функция ПолучитьUuidПодчиненногоОбъекта(ПутьОбъектаАнгл, КлассОбъекта)
	
	МассивПутиАнгл = СтрРазделить(ПутьОбъектаАнгл, ".", Ложь);
	КоличествоЭлементовПутиАнгл = МассивПутиАнгл.Количество();
	
	// Если путь объекта короче 4-х элементов, то это не подчиненный объект.
	Если КоличествоЭлементовПутиАнгл < 4 Тогда
		Возврат "";
	КонецЕсли;
	
	КлассРодителяОбъектаМнЧ = МассивПутиАнгл[0];
	ПутьРодителяОбъекта = КлассРодителяОбъектаМнЧ + "\" + МассивПутиАнгл[1];
	
	ФайлВыгрузкиXML = КаталогВыгрузкиРезультат + ПутьРодителяОбъекта + ".xml";
	Если НЕ апк_ФайлСуществует(ФайлВыгрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяОбъекта = МассивПутиАнгл[МассивПутиАнгл.ВГраница()];
	КлассРодителяОбъектаЕдЧ = ПолучитьТипОбъектаПоТаблицеТипов(КлассРодителяОбъектаМнЧ, "ИмяАнглМнФормы", "ИмяАнгл");
	
	Данные = ПолучитьДанныеXDTO(ФайлВыгрузкиXML);
	ДанныеОбъектаРодителя = Данные[КлассРодителяОбъектаЕдЧ];
	
	// Проверяем, что у объекта-родителя указаны подчиненные объекты.
	СвойстваОбъектаРодителя = ДанныеОбъектаРодителя.Свойства();
	Если СвойстваОбъектаРодителя.Получить("ChildObjects") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеПодчиненныхОбъектов = ДанныеОбъектаРодителя["ChildObjects"];
	
	// Проверяем, что среди подчиненных объектов есть нужный класс объекта.
	СвойстваПодчиненныхОбъектов = ДанныеПодчиненныхОбъектов.Свойства();
	Если СвойстваПодчиненныхОбъектов.Получить(КлассОбъекта) = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПодчиненныеОбъектыПоКлассу = ДанныеПодчиненныхОбъектов[КлассОбъекта];
	
	ПодчиненныйОбъект = Неопределено;
	Если ТипЗнч(ПодчиненныеОбъектыПоКлассу) = Тип("ОбъектXDTO") Тогда
		Если СтрСравнить(ПолучитьИмяПодчиненногоОбъектаXDTO(ПодчиненныеОбъектыПоКлассу), ИмяОбъекта) = 0 Тогда
			ПодчиненныйОбъект = ПодчиненныеОбъектыПоКлассу;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПодчиненныеОбъектыПоКлассу) = Тип("СписокXDTO") Тогда
		Для Каждого ПодчиненныйОбъектПоКлассу Из ПодчиненныеОбъектыПоКлассу Цикл
			Если СтрСравнить(ПолучитьИмяПодчиненногоОбъектаXDTO(ПодчиненныйОбъектПоКлассу), ИмяОбъекта) = 0 Тогда
				ПодчиненныйОбъект = ПодчиненныйОбъектПоКлассу;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПодчиненныйОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	СвойстваПодчиненногоОбъекта = ПодчиненныйОбъект.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("uuid") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПодчиненныйОбъект.uuid;
	
КонецФункции

Функция ПолучитьUuidОбъекта(ПутьОбъектаАнгл, КлассОбъекта)
	
	// XML файла для команды не существует, описание команды содержится в XML файле его родителя.
	Если КлассОбъекта = "Command" Тогда
		Возврат ПолучитьUuidПодчиненногоОбъекта(ПутьОбъектаАнгл, КлассОбъекта);
	КонецЕсли;
	
	ИмяФайла = СтрЗаменить(ПутьОбъектаАнгл, ".", "\");
	ФайлВыгрузкиXML = КаталогВыгрузкиРезультат + ИмяФайла + ".xml";
	
	Если НЕ апк_ФайлСуществует(ФайлВыгрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	Данные = ПолучитьДанныеXDTO(ФайлВыгрузкиXML);
	
	Возврат Данные[КлассОбъекта].uuid;
	
КонецФункции

Процедура ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектов() Экспорт
	
	Если ПравилаПоддержкиОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		Если НЕ СтрокаРезультата.Изменен Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрокаРезультата.ЗахваченВХранилище Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьОбъектаАнглМнЧ = ПолучитьПутьОбъектаИзФайлаВыгрузкиXML(СтрокаРезультата.ПолноеИмяФайла,, "ИмяАнглМнФормы");
		КлассОбъектаМнЧ = ПолучитьКлассОбъекта(ПутьОбъектаАнглМнЧ);
		КлассОбъектаЕдЧ = ПолучитьТипОбъектаПоТаблицеТипов(КлассОбъектаМнЧ, "ИмяАнглМнФормы", "ИмяАнгл");
		
		uuidОбъекта = ПолучитьUuidОбъекта(ПутьОбъектаАнглМнЧ, КлассОбъектаЕдЧ);
		
		СтрокаПравилПоддержки = ПравилаПоддержкиОбъектов.Найти(uuidОбъекта, "Объект");
		Если СтрокаПравилПоддержки <> Неопределено Тогда
			СтрокаРезультата.РедактированиеРазрешено = (СтрокаПравилПоддержки.ПравилоПоддержки <> "Не редактируется");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстПреамбулы()
	
	МакетШаблонТекстаПреамбулы = ПолучитьМакет("ШаблонТекстаПреамбулы");
	Возврат МакетШаблонТекстаПреамбулы.ПолучитьТекст();
	
КонецФункции

Процедура УстановитьТекстПреамбулы() Экспорт
	
	ТекстПреамбулыПрограммныхМодулей = ПолучитьТекстПреамбулы();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайламиИКаталогами

Функция ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога)
	
	// Проверяем лог запуска конфигуратора.
	Если НЕ апк_ФайлСуществует(ФайлЛога) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ФайлЛога);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	апк_ФайлУдалить(ФайлЛога);
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьКаталогФайла(ПутьКФайлу) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Путь;
	
КонецФункции

// Получает путь к информационной базе в следующем формате:
// - для серверных баз <Путь к серверу>\<Путь к базе>
// - для файловых баз путь к каталогу где расположена информационная база с "\" в конце.
// Параметры:
//  ПутьКБазе - Строка - путь к базе, который необходимо преобразовать к формату
// Возвращаемое значение: 
//  Тип Строка.
//
Функция ПолучитьПутьКБазе(Знач ПутьКБазе) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПутьКБазе) Тогда 
		Возврат "";
	КонецЕсли;
	
	ПутьКБазе = СокрЛП(ПутьКБазе);
	
	// Если на вход подается строка соединения с файловой базой, то получаем каталог из строки соединения.
	Если СтрНайти(ПутьКБазе, "File=") > 0 Тогда
		СтрокаПодключения = НСтр(ПутьКБазе, "File");
		// Добавляем слэш в конце.
		Возврат КаталогДобавитьСлэш(СтрокаПодключения);
	КонецЕсли;
	
	// Если на вход подается строка соединения с серверной базой, то формируем путь к базе из строки соединения.
	Если СтрНайти(ПутьКБазе, "Srvr=") > 0 Тогда
		Сервер = НСтр(ПутьКБазе, "Srvr");
		ИмяБазы = НСтр(ПутьКБазе, "Ref");
		Возврат Сервер + "\" + ИмяБазы;
	КонецЕсли;
	
	// Проверяем, указан путь к серверной базе или к файловой.
	Если (СтрНайти(ПутьКБазе, ":\") = 0 И СтрНайти(ПутьКБазе, "$\") = 0 И СтрНайти(ПутьКБазе, "\\") = 0) Тогда
		// Если в пути к серверной базе указан слэш в конце, то убираем его.
		Возврат ?(Лев(ПутьКБазе, 1) = "\", Прав(ПутьКБазе, СтрДлина(ПутьКБазе) - 1), ПутьКБазе)
	КонецЕсли;
	
	// Убираем имя файла из конца пути к базе.
	КаталогБазы = ?(СтрНайти(ВРег(ПутьКБазе), "1CV8.1CD") = 0, ПутьКБазе, ПолучитьКаталогФайла(ПутьКБазе));
	// Добавляем слэш в конце каталога файловой базы.
	Возврат КаталогДобавитьСлэш(КаталогБазы);
	
КонецФункции

// Выполняет проверку того, является ли указанная база файловой.
// Параметры:
//  ПутьКБазе - Строка - путь к базе
// Возвращаемое значение:
//  Булево - Истина если база файловая, Ложь если серверная.
//
Функция ЭтоФайловаяБаза(Знач ПутьКБазе) Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьКБазе) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	ПутьКБазе = ПолучитьПутьКБазе(ПутьКБазе);
	
	Возврат СтрНайти(ПутьКБазе, ":\") ИЛИ СтрНайти(ПутьКБазе, "$\") ИЛИ СтрНайти(ПутьКБазе, "\\");
	
КонецФункции

Функция ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
	
	Возврат ?(ЭтоФайловаяБаза(ПутьКБазе), " /F", " /S") + ЗаключитьСтрокуВКавычки(ПолучитьПутьКБазе(ПутьКБазе));
	
КонецФункции

Функция апк_ФайлСуществует(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();
	
КонецФункции

// Удаляет в попытке указанный файл или каталог.
// Действует аналогично методу УдалитьФайлы().
//
Процедура апк_ФайлУдалить(ИмяФайла, Маска = "")
	
	Если НЕ апк_ФайлСуществует(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ИмяФайла, Маска);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура апк_КаталогКопировать(Источник, Приемник)
	
	НайденныеФайлы = НайтиФайлы(Источник, "*");
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		ИмяФайлаИсточника = Файл.ПолноеИмя;
		ИмяФайлаПриемника = СтрЗаменить(ИмяФайлаИсточника, Источник, Приемник);
		
		Если Файл.ЭтоКаталог() Тогда
			СоздатьКаталог(ИмяФайлаПриемника);
			апк_КаталогКопировать(ИмяФайлаИсточника, ИмяФайлаПриемника);
		Иначе
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьКаталогВыгрузки(Источник, Приемник) Экспорт
	
	Попытка
		апк_КаталогКопировать(Источник, Приемник);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ОчиститьКаталогиВыгрузки(Маска = "*")
	
	Попытка
		УдалитьФайлы(КаталогВыгрузки, Маска);
		УдалитьФайлы(КаталогВыгрузкиРезультат, Маска);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаключитьСтрокуВКавычки(Строка)
	
	Возврат """" + Строка + """";
	
КонецФункции

Функция КаталогДобавитьСлэш(Каталог)
	
	Если НЕ СтрЗаканчиваетсяНа(Каталог, "\") Тогда
		Каталог = Каталог + "\";
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции

// Получает текст переданного файла.
//
Функция апк_ФайлПолучитьТекст(ПолноеИмяФайла, УдалитьФайл = Истина) Экспорт
	
	// Проверяем существование файла.
	Если НЕ апк_ФайлСуществует(ПолноеИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	
	// Получаем текст.
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.Прочитать(ПолноеИмяФайла);
	Текст = ДокументТекст.ПолучитьТекст();
	
	Если УдалитьФайл Тогда
		апк_ФайлУдалить(ПолноеИмяФайла);
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область АвтоформатированиеКодаМодулей

Процедура ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла)
	
	СтрокаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаРезультата <> Неопределено Тогда
		СтрокаРезультата.Изменен = Истина;
	КонецЕсли;
	
	ДокументТекст.Записать(ПолноеИмяФайла);
	
КонецПроцедуры

// Процедура вызывается в том случае, когда невозможно исправить ошибку
// Параметры:
//  Объект - обрабатываемый модуль
//  Описание - описание ошибки
//  Строка - номер строки с ошибкой.
//
Процедура ОбработатьИсключение(ПолноеИмяФайла, Описание, Строка)
	
	СтрокаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРезультата.Изменен = Истина;
	СтрокаРезультата.СчетчикПропущенных = СтрокаРезультата.СчетчикПропущенных + 1;
	СтрокаРезультата.Пропущено = Нстр("ru ='Пропущено мест: '") + СтрокаРезультата.СчетчикПропущенных;
	
	Если СтрокаРезультата.СчетчикПропущенных > 1 Тогда
		СтрокаРезультата.УточнениеИсключения = СтрокаРезультата.УточнениеИсключения + Символы.ПС;
	КонецЕсли;
	
	СтрокаРезультата.УточнениеИсключения = СтрокаРезультата.УточнениеИсключения 
		+ Строка(СтрокаРезультата.СчетчикПропущенных) + ". Строка " + Строка(Строка) + " - " + Описание;
	
КонецПроцедуры

Процедура ОбработатьТекстыМодулей() Экспорт
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		СтрокаФайлаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
		
		Если СтрокаФайлаРезультата = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаФайлаРезультата.ЗахваченВХранилище И СтрокаФайлаРезультата.РедактированиеРазрешено Тогда
			ОбработатьТекстМодуля(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьТекстМодуля(ПолноеИмяФайла)
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.Прочитать(ПолноеИмяФайла);
	
	ОбъектИзменен = Ложь;
	
	ОбъектИзмененПравилом = ВставитьТекстПреамбулыВМодуль(ДокументТекст);
	ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Функция ВставитьТекстПреамбулыВМодуль(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	
	ТекстМодуляВРег = ТекстМодуля;
	
	// Изменяем текст модуля и преамбулы для проверки уже ранее вставленного текста преамбулы.
	ТекстМодуляВРег = ВРег(ТекстМодуляВРег);
	ТекстМодуляВРег = СокрЛ(ТекстМодуляВРег);
	ТекстМодуляВРег = СтрЗаменить(ТекстМодуляВРег, " ", "");
	ТекстМодуляВРег = СтрЗаменить(ТекстМодуляВРег, Символы.Таб, "");
	ТекстМодуляВРег = СтрЗаменить(ТекстМодуляВРег, Символы.ПС, "");
	ТекстМодуляВРег = СтрЗаменить(ТекстМодуляВРег, Символы.ВК, "");
	
	ТекстПреамбулы = ТекстПреамбулыПрограммныхМодулей;
	ТекстПреамбулы = ВРег(ТекстПреамбулы);
	ТекстПреамбулы = СокрЛ(ТекстПреамбулы);
	ТекстПреамбулы = СтрЗаменить(ТекстПреамбулы, " ", "");
	ТекстПреамбулы = СтрЗаменить(ТекстПреамбулы, Символы.Таб, "");
	ТекстПреамбулы = СтрЗаменить(ТекстПреамбулы, Символы.ПС, "");
	ТекстПреамбулы = СтрЗаменить(ТекстПреамбулы, Символы.ВК, "");
	
	// В тексте преамбулы может быть указан год в виде изменяемого параметра, будем сравнивать без него.
	ПозицияПараметра = СтрНайти(ТекстПреамбулы, "%");
	Если ПозицияПараметра = 0 Тогда
		ПозицияПараметра = СтрДлина(ТекстПреамбулы) + 1;
	КонецЕсли;
	
	ТекстПреамбулыДоПараметра = Лев(ТекстПреамбулы, ПозицияПараметра - 1);
	
	// Если преамбула уже вставлена в текст модуля, то пропускаем.
	Если СтрНачинаетсяС(ТекстМодуляВРег, ТекстПреамбулыДоПараметра) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Заменяем изменяемые параметры.
	ТекущийГод = Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0");
	ТекстДляВставки = СтрЗаменить(ТекстПреамбулыПрограммныхМодулей, "%Год%", ТекущийГод);
	
	// Вставляем текст преамбулы в начало модуля.
	ТекстМодуля = СокрП(ТекстДляВставки) + Символы.ПС + Символы.ПС + СокрЛ(ТекстМодуля);
	
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ФайлИзменен = Истина;
	
	Возврат ФайлИзменен;
	
КонецФункции

#КонецОбласти

#Область Инициализация

ТаблицаТиповОбъектов = Неопределено;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли