///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПОДСИСТЕМА СЕРВИС КРИПТОГРАФИИ DSS
//
// Содержит базовый функционал для взаимодействия с сервисами КриптоПро DSS по протоколу HTTP-сервисов (REST-API)
// - процедуры аутентификации и авторизации
// - работа с сертификатами
// - выполнение криптографических операций
// - сервисные функции
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает данные одного и всех сертификатов учетной записи
//
// Параметры:
//  ИдентификаторПользователя 	- СправочникСсылка.УчетныеЗаписиDSS, Структура - см. функцию НастройкиПользователяПоУмолчанию()
//  ИдентификаторСертификата 	- Число - идентификатор сертификата в сервисе DSS
//  ПараметрыОперации 			- Структура, ФиксированнаяСтруктура - позволяет указать дополнительные параметры операции. Проверяются поля:
//    * ПроверитьНаличиеВБазе 	- Булево - синхронизировать получены данные с сервера с данным из РегистраСведений.СертификатыПользователяDSS
//			
// Возвращаемое значение:
//   Структура - подробнее СервисКриптографииDSSКлиентСервер.ОтветСервисаПоУмолчанию:
//     * Результат 			- Соответствие - список сертификатов
//     * Выполнено				- Булево
//     * МаркерОбновлен 		- Булево
//
Функция ПолучитьСертификатыСервиса(ИдентификаторПользователя, ИдентификаторСертификата = Неопределено, ПараметрыОперации = Неопределено) Экспорт
	
	
КонецФункции

#КонецОбласти

