///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// фывафыва
//
// Возвращаемое значение:

//   см. ОбщийМодуль3.АвтоформатироватьКод.Параметр1
Функция ф1() Экспорт
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область УстаревшиеПроцедурыИФункции

// Устарела.
Процедура НаРасположениеКоторойРугаетсяАПК(Параметр1)
	
	
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // ПрограммныйИнтерфейс