///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура п1()
	#Если ТонкийКлиент Тогда
	ЗапуститьПриложение("");
	#КонецЕсли
КонецПроцедуры

Процедура п2()
	#Если ТонкийКлиент Тогда
	ЗапуститьПриложение("");
	#КонецЕсли
КонецПроцедуры

#КонецЕсли
