///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Описание бла-бла-бла.
//
// Параметры:
//  ИдентификаторФормы - Массив из см. фывафывафывафыва() - описание см. ячсмячсмячсм.йцукйцук().
//
//  ПараметрыМетода - см. НастройкиСкрытияПерсональныхДанныхСистемы
//  странный параметр - см. йцук - описание странного параметра
//  МногострочныйПараметр - Строка, Массив, Число - очень длинное описание многострочного параметра
//                                                  на много - много-много
//                                                  ооооооооооооооооооооооооооооооочень много строк.
//  ПараметрСМножествомТипов - Строка - строка
//                             Число - Число
//                                   - Булево
//                                   - НеопределенныйТип
//  ДополнительныеПараметры - см. ПараметрыПечати
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне
//
Функция ЗапуститьИзменениеНастроекСкрытияПДнВФоновомЗадании(Знач ИдентификаторФормы, Знач ПараметрыМетода) Экспорт
	
КонецФункции

// Открывает форму для проведения документов _ДемоСчетФактураПолученный,
// выявленные проверкой поиска непроведенных документов
// (см. _ДемоСтандартныеПодсистемы.ПроверитьПроведенностьСчетаФактурыПолученного).
//
// Параметры:
//    ПараметрыИсправления  - Структура:
//      * ИдентификаторПроверки - Строка - строковый идентификатор проверки.
//      * ВидПроверки           - СправочникСсылка.ВидыПроверок - вид проверки, к которому
//                                относится выполненная проверка.
//    ДополнительныеПараметры - Неопределено - параметр не используется.
//
Процедура ПровестиСчетаФактурыПоПроблемнымКонтрагентам(ПараметрыИсправления, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - форма отчета.
//   КлючВарианта - Строка - имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - см. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
	
	ЗапуститьПриложение("");
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - форма отчета.
//   Отказ - передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПередЗаписью(Отказ)
	
	а = 1;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт	
	
	Элемент = Элементы.Добавить();
	
	Элемент.ИмяПредопределенныхДанных = "ВсеОбъектыАдресации";
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
			"ru='Все объекты адресации'", КодыЯзыков); // @НСтр-2
	КонецЕсли;
	
КонецПроцедуры
		
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли