///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//// Проверяем АвтоТест и выходим.
	//Если Параметры.Свойство("АвтоТест") Тогда
	//	Возврат;
	//КонецЕсли;
	
	Расширение = РасширенияКонфигурации.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Справочник1.Ссылка
	|ИЗ
	|	Справочник.Справочник1 КАК Справочник1
	|ГДЕ
	|	Справочник1.Наименование ПОДОБНО Справочник1.Код";
	
	//Результат = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Справочник1.Ссылка
	|ИЗ
	|	Справочник.Справочник1 КАК Справочник1
	|ГДЕ
	|	Справочник1.Наименование ПОДОБНО ""%0"" + ""0%""";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	а = 1;
	
КонецПроцедуры

Процедура п1(фывафыва, фыва, цукецуке) Экспорт
	
КонецПроцедуры