
&НаКлиенте

#Область фыва

Процедура Команда1(Команда)
	
	//ПодключитьОбработчикОжидания("ПроверкаПараметров", 1, Ложь);
	
	//ОбщийМодуль3.АвтоформатироватьКод();
	
	а = ПолучитьИмяВременногоФайла();
	
	СтандартнаяОбработка = Истина;
	
	//Если СтандартнаяОбработка И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетХозрасчетныхОрганизаций") Тогда
	//	Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетХозрасчетныхОрганизацийКлиент");
	//	Модуль.ОткрытьФормуСпискаДокументаОтражениеЗарплатыВБухучете(, ЭтотОбъект);
	//КонецЕсли;
	
	РаботаСБанкамиКлиент.ВыбратьИзСправочникаБИК(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбщийМодуль3КлиентСервер.АвтоформатироватьКод("");
	
КонецПроцедуры

#КонецОбласти