///////////////////////////////////////////////////////////////////////////////////////
//фывафыва
//фывафыва
//смитсмитсмит
//////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// фывафывафыва
Процедура а1()
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
КонецПроцедуры