///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли

#Если ТонкийКлиент Тогда
	
#КонецЕсли

Процедура ПриНачалеРаботыСистемы() // sfdgsdfgsdfg
	
ТекстЗапроса = 
"ВЫБРАТЬ
|	Организации.Ссылка
|ИЗ
|	Справочник.Организации КАК Организации
|ГДЕ
|	Организации.Код = &Код"


КонецПроцедуры
