
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	а = 1;
	
	//WindowsЦвета.ApplicationWorkspace
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ИмяСсылкиРеестра = "Ссылка";
	ИмяНомерСтрокиРеестра = "НомерСтроки";
	Если ОплатаПраздничныхДней Тогда
		ИмяСсылкиРеестра = "СсылкаРеестрПраздничных";
		ИмяНомерСтрокиРеестра = "НомерСтрокиРеестрПраздничных";
	КонецЕсли;

КонецПроцедуры

// Возвращает Истина, если клиентское приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево -  если нет клиентского приложения, возвращается Ложь.
//
&НаКлиенте
Функция ЭтоWindowsКлиент()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоWindowsКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	
	Возврат ЭтоWindowsКлиент;
	
	//если Текст = "Хорошая погода" тОгда
	//	
	//Конецесли;
	
	
	
КонецФункции

