
// Назначение: для вызова из конструктора ограничений СППР.
// Перед передачей параметра РазобранноеОграничение в свойстве ПоляТаблиц должны быть заполнены
// вложенные свойства ТаблицаСуществует, ПолеСОшибкой, СодержитТип, ИмяСуществует.
// 
// Параметры:
//  РазобранноеОграничение - см. РазобранноеОграничение
//
// Возвращаемое значение:
//  Структура:
//   * ОписаниеОшибок - Структура:
//      ** ЕстьОшибки  - Булево - если Истина, значит найдена одна или более ошибок.
//      ** ТекстОшибок - Строка - текст всех ошибок.
//      ** Ограничение - Строка - пронумерованный текст ограничения со вставками "<<?>>".
//      ** Ошибки      - Массив из Структура - описания отдельных ошибок:
//         *** НомерСтроки    - Число -  строка в многострочном тексте, в которой найдена ошибка.
//         *** ПозицияВСтроке - Число -  номер символа, начиная с которого обнаружена ошибка,
//                                       может быть за пределами строки (длина строки + 1).
//         *** ТекстОшибки    - Строка - текст ошибки без описания позиции.
//         *** СтрокаОшибки   - Строка - строка, в которой найдена ошибка со вставкой "<<?>>".
//      ** Дополнение - Строка - описание вариантов первых ключевых слов частей ограничения.
//
//   * ДополнительныеТаблицы - Массив из Структура:
//      ** Таблица           - Строка - полное имя объекта метаданных.
//      ** Псевдоним         - Строка - имя псевдонима таблицы.
//      ** УсловиеСоединения - Структура - как у свойства ОграничениеИзменения, но только
//                                     узлы: "Поле", "Значение", "Константа", "И", "=".
//   * ПсевдонимОсновнойТаблицы - Строка - заполнено, если указаны дополнительные таблицы.
//   * ОграничениеЧтения    - Структура - как у свойства ОграничениеИзменения.
//   * ОграничениеИзменения - Структура:
//
//      ** Узел - Строка - одна из строк "Поле", "Значение", "Константа",
//           "И", "Или", "Не", "=", "<>", "В", "ЕстьNull", "Тип", "ТипЗначения", "Выбор",
//           "ЗначениеРазрешено",      "ЭтоАвторизованныйПользователь",
//           "ЧтениеОбъектаРазрешено", "ИзменениеОбъектаРазрешено",
//           "ЧтениеСпискаРазрешено",  "ИзменениеСпискаРазрешено",
//           "ДляВсехСтрок",           "ДляОднойИзСтрок".
//
//     Свойства узла "Поле".
//       ** Имя       - Строка - имя поля, например, "Организация" или "ОсновнаяОрганизация".
//       ** Таблица   - Строка - имя таблицы этого поля (или пустая строка для основной таблицы).
//       ** Псевдоним - Строка - имя псевдонима присоединяемой таблицы этого поля (или пустая строка для основной таблицы),
//                        например, "РегистрСведенийНастройки" для поля "ОсновнаяОрганизация".
//       ** Выразить  - Строка - имя таблицы (если используется), например, для описания поля в виде:
//                       "ВЫРАЗИТЬ(ВЫРАЗИТЬ(Владелец КАК Справочник.Файлы).ВладелецФайла КАК Справочник.Организации).Ссылка".
//       ** Вложение  - Структура - узел Поле, содержащий вложенное действие ВЫРАЗИТЬ (с или без ЕстьNull).
//                    - Неопределено - нет вложенного поля.
//       ** ЕстьNull  - Структура - узел Значение Или Константа, например, для описания выражения вида
//                        "ЕстьNULL(Владелец, Значение(Справочник.Файлы.ПустаяСсылка))".
//                    - Неопределено - если ЕстьNull не используется (в том числе, когда свойство Вложение заполнено).
//
//     Свойства узла "Значение".
//       ** Имя - Строка - имя значения, например, "Справочник.Организации.Основная",
//                                                 "Справочник.Организации.ПустаяСсылка".
//
//     Свойства узла "Константа".
//       ** Значение - Булево
//                   - Число  - произвольное целое число до 16 разрядов
//                   - Строка - произвольная строка до 150 символов
//                   - Неопределено
//
//     Свойства узлов "И", "Или".
//       ** Аргументы - Массив - с элементами:
//            *** Значение - Структура - любой узел, кроме Значение и Константа.
//
//     Свойства узла "Не".
//       ** Аргумент - Структура - любой узел, кроме Значение и Константа.
//
//     Свойства узлов "=", "<>".
//       ** ПервыйАргумент - Структура - узел Поле.
//       ** ВторойАргумент - Структура - узел Значение, Константа. А узел Поле только для условия соединения.
//
//     Свойства узла "В".
//       ** Искомое  - Структура - узел Поле.
//       ** Значения - Массив - с элементами:
//            *** Значение - Структура - узлы Значение и/или Константа.
//
//     Свойства узла "ЕстьNull".
//       ** Аргумент - Структура - узел Поле (выражение вида "<Поле> ЕСТЬ NULL").
//
//     Свойства узла "Тип".
//       ** Имя - Строка - имя таблицы, например, "Справочник.Организации".
//
//     Свойства узла "ТипЗначения".
//       ** Аргумент - Структура - узел Поле.
//
//     Свойства узла "Выбор".
//       ** Выбор - Структура - узел Поле.
//                - Неопределено - условия содержат выражение, а не узел Значение.
//       ** Когда - Массив - с элементами:
//            *** Значение - Структура:
//                  **** Условие  - Структура - узел Значение, если свойство Выбор указано, в противном случае
//                                              узлы И, Или, Не, =, <>, В (распространяется на вложенное содержимое).
//                  **** Значение - Структура - узел, кроме Выбор.
//       ** Иначе - Структура - узел, кроме ВЫБОР и Значение (Поле и Константа может быть только типа Булево).
//
//     Свойства узлов "ЗначениеРазрешено",      "ЭтоАвторизованныйПользователь",
//                    "ЧтениеОбъектаРазрешено", "ИзменениеОбъектаРазрешено",
//                    "ЧтениеСпискаРазрешено",  "ИзменениеСпискаРазрешено".
//       ** Поле - Структура - узел Поле.
//       ** Типы - Массив - с элементами:
//            *** Значение - Строка - полное имя таблицы
//       ** ПроверятьТипыКромеУказанных - Булево - если Истина, то все типы свойства Поле,
//                                                 кроме указанных в свойстве Типы.
//       ** УточненияСравнения - Соответствие из КлючИЗначение:
//            *** Ключ     - Строка - уточняемое значение "Неопределено", "Null", "ПустаяСсылка",
//                                    <полное имя таблицы>, "Число", "Строка", "Дата", "Булево".
//            *** Значение - Строка - результат "Ложь", "Истина".
//
//     Свойства узлов "ДляВсехСтрок", "ДляОднойИзСтрок".
//       ** Аргумент - Структура - любой узел.
//
Функция СтруктураОграничения(РазобранноеОграничение) Экспорт
	
	//Возврат УправлениеДоступомСлужебный.СтруктураОграничения(РазобранноеОграничение);
	
КонецФункции

// Для процедура ВыполнитьОбновлениеДоступаСписка.
//
// Возвращаемое значение:
//   Структура:
//     * ЭтоОбновлениеПрав        - Булево
//     * ИдентификаторСписка      - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//                                - СправочникСсылка.ИдентификаторыОбъектовРасширений
//     * ДляВнешнихПользователей  - Булево
//     * Кэш                      - см. НовыйКэшКонтекста
//     * ДатаНачала               - Дата
//     * ДатаОкончания            - Дата
//     * МаксимумПорцийИзИсходной - Число
//     * ИдентификаторСправочникаНаборыГруппДоступа - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//     * ГраницаВремениОбработки  - Дата
//
//    Когда ЭтоСправочникНаборыГруппДоступа Тогда
//     * СписокСДатой    - Булево
//     * СписокСПериодом - Булево
//     * ЭтоСсылочныйТип - Булево
//     * ПустойНаборГруппДоступа - СправочникСсылка.НаборыГруппДоступа
//
//    Иначе
//     * ИдентификаторТранзакции - УникальныйИдентификатор
//     * ЗависимыеСпискиПоКлючамДоступа - Массив из Строка - полные имена списков
//     
//   Свойства добавляемые в процессе работы:
//     * ЕстьИзмененияПрав - Булево
//     * ОбновитьПраваНаКлючи - Булево
//     * ПоследнийОбновленныйЭлемент - см. НачальныйЭлемент
//     * НовыйПоследнийОбновленныйЭлемент - см. НачальныйЭлемент
//     * ПерезапускОбновления - Булево
//     * ЕстьЗадания - Булево
//     * ТочечноеЗадание - см. ПодготовленноеТочечноеЗадание
//     * НаборПорций - Массив из см. ПорцияИзНабора
//     * ТипПользователя - Тип
//     * ТипГруппыПользователей - Тип
//     * ТипГруппыДоступа - Тип
//     * ПустаяГруппаДоступа - СправочникСсылка.ГруппыДоступа
//     * ПраваГруппДоступаСписка               - см. НовыеПраваГруппДоступаСписка
//     * ПользователиГруппПользователей        - см. НовыеПользователиГруппПользователей
//     * ГруппыПользователейКакЗначенияДоступа - см. НовыеГруппыПользователейКакЗначенияДоступа
//     * УчастникиГруппДоступа                 - см. НовыеУчастникиГруппДоступа
//     * ГруппыПользователейГруппДоступа       - см. НовыеГруппыПользователейГруппДоступа
//     * ЗначенияГруппДоступа                  - см. НовыеЗначенияГруппДоступа
//     * РолиПрофилейГруппДоступа              - см. НовыеРолиПрофилейГруппДоступа
//     * ГруппыДоступаПрофилей                 - см. НовыеГруппыДоступаПрофилей
//     * ПраваНаСпискиВедущихКлючейДоступа     - см. НовыеПраваНаСпискиВедущихКлючейДоступа
//     * ПраваНаВедущиеКлючиДоступа            - см. НовыеПраваНаВедущиеКлючиДоступа
//     * ПраваНаВедущиеСписки                  - см. НовыеПраваНаВедущиеСписки
//     * ПраваПоВладельцамНастроекПрав         - см. НовыеПраваПоВладельцамНастроекПрав
//     * МодельОбъектовВПамяти - см. МодельОбъектовВПамяти
//   
//   Копия свойств из см. ПараметрыОграниченияПоСтруктуреОграничения 
//     * Список                  - Строка
//     * ДляВнешнихПользователей - Булево
//     * Версия                  - Строка
//     * ВедущиеСписки           - см. НовыеВедущиеСписки
//     * ДоступЗапрещен          - Булево
//     * ОграничениеОтключено    - Булево
//     * ОграничениеЧтенияОтключено - Булево
//     * ПолеВладельца - см. НовоеПолеВладельца
//     * ТребуетсяОграничениеПоВладельцу    - Булево
//     * ИспользуетсяОграничениеПоВладельцу - Булево
//     * РассчитыватьПраваПользователей     - Булево
//     * ЕстьЗависимыеСпискиБезЗаписиКлючейДоступа
//     * ЧтениеРазрешеноДляВсехПользователей - Булево
//     * ИзменениеРазрешеноДляВсехПользователей - Булево
//     * ЕстьВедущиеКлючиДоступа                - Булево
//     * ЕстьВедущиеСпискиПоПравам              - Булево
//     * ЕстьФункцияПравоДоступаИлиРольДоступна - Булево
//     * ТипыВладельцевНастроекПрав        - ФиксированноеСоответствие
//     * ИдентификаторТаблицыНастроекПрав  - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//     * ЕстьВладельцыНастроекПрав         - Булево
//     * ИспользуемыеТипыЗначенийДоступа   - Массив из Тип
//     * ВсеВидыОграниченийПрав            - Соответствие
//     * ПоляТаблицОбъекта                 - Массив из см. НовыеПоляТаблицыОбъекта
//     * ИмяОтдельногоРегистраКлючей       - Строка
//     * ОпорныеПоля                       - см. НовоеОписаниеОпорныхПолей
//     * ВариантДоступа                    - Число
//     * СоставПолей                       - Число
//     * ЕстьОграничениеЧтения             - Булево
//     * ЕстьОграничениеИзменения          - Булево
//     * ЕстьОграничениеПоПользователям    - Булево
//     * СтруктураРасчетаПраваЧтение       - см. СтруктураРасчетаПрава
//     * СтруктураРасчетаПраваИзменение    - см. СтруктураРасчетаПрава
//     * Контекст                          - см. КонтекстПараметровПоСтруктуреОграничения
//
//   Свойства, добавляемые в процедуре ДобавитьТекстыЗапросовВПараметрыОграничения:
//     * ТекстЗапросаПроверкиПравЧтениеИзменение - Строка
//     * ТекстЗапросаПроверкиПраваЧтение - Строка
//     * ПолеОбъектаВладельцаВЗапросеПроверкиПрав - Строка
//     * ТекстЗапросаУстаревшихЭлементовДанных - Строка
//     * ТаблицыКлюча - Массив из Строка
//     * РеквизитыТаблицКлюча - см. НовыеРеквизитыТаблицКлюча
//     * ТекстЗапросаЭлементовДанныхСУстаревшимиКлючами - Строка
//     * ТекстЗапросаЭлементовДанныхБезКлючейДоступа - Строка
//     * ТекстЗапросаНовыхКомбинацийЗначенийОпорныхПолейСуществующихЗаписей - Строка
//     * ТекстЗапросаНовыхКомбинацийЗначенийОпорныхПолейНовыхЗаписей - Строка
//     * ОписаниеЗапросовУстаревшихКлючейДоступаПоВедущимОбъектам - Строка
//     * ТекстЗапросаТекущихКлючейДоступаРегистра - Строка
//     * ТекстЗапросаЗначенийЭлементовДанныхДляКлючейДоступа - Строка
//     * ТекстЗапросаЗначенийОбъектовВПамятиДляКлючейДоступа - Строка
//     * ТекстЗапросаЗначенийИзИспользуемыхКлючейДоступаДляСравнения - Строка
//     * ТекстЗапросаЗначенийИзВсехКлючейДоступаДляСравнения - Строка
//     * ТекстЗапросаСуществованияКлючейДляСравнения - Строка
//     * ТекстЗапросаКлючейДоступаДляОбновленияПрав - Строка
//     * ТекстЗапросаКлючейПоВедущимКлючамДляОбновленияПрав - Строка
//     * ТекстЗапросаЗначенийИзКлючейДоступаДляРасчетаПрав - Строка
//     * ТекстЗапросаУстаревшихКлючейДоступа - Строка
//
Функция ПараметрыОбновления(ОбщиеПараметрыОбновления, ОбъектМетаданных)
	
	Попытка
		а = 1;
	Исключение //АПК:280
		// бла-бла-бла
	КонецПопытки;
	
КонецФункции