///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Команда1(Команда)
	
	Команда2();
	
КонецПроцедуры


&НаСервере
Процедура Команда2()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ТекстПисьмаHTMLДляШаблона();
	
КонецПроцедуры

