///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Объект.ХозяйственнаяОперация) Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ЗначениеКопирования", ЗначениеКопирования);
		
		ОткрытьФормуПоХозОперации(Объект.ХозяйственнаяОперация, ЗначенияЗаполнения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И Параметры.ЗначенияЗаполнения.Свойство("ЗначениеКопирования") Тогда
		
		ЗначениеКопирования = Параметры.ЗначенияЗаполнения.ЗначениеКопирования;
	
	Иначе
		
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.ВводОстатковОПродажахЗаПрошлыеПериоды);
		ПараметрыОтбора = ВводОстатковСервер.ИнициализироватьПараметрыОтбораДоступныхХозяйственныхОпераций();
		ПараметрыОтбора.ДокументВводаОстатков = ИдентификаторОбъекта;
		СписокВидовОпераций.ЗагрузитьЗначения(ВводОстатковСервер.ДоступныеХозяйственныеОперации(ПараметрыОтбора));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОперацию(Команда)

	ХозяйственнаяОперация = Элементы.СписокВидовОпераций.ТекущиеДанные.Значение;
	
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		ОткрытьФормуПоХозОперации(ХозяйственнаяОперация, ЗначенияЗаполнения);
		
	КонецЕсли;КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыСписокВидовОпераций

&НаКлиенте
Процедура СписокВидовОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ХозяйственнаяОперация = Элемент.ТекущиеДанные.Значение;
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		ОткрытьФормуПоХозОперации(ХозяйственнаяОперация, ЗначенияЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПоХозОперации(ХозяйственнаяОперация, ЗначенияЗаполнения)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ИмяОткрываемойФормы = ВводОстатковВызовСервера.ПолучениеФормыВводаОстатковОПродажахЗаПрошлыеПериоды(ХозяйственнаяОперация);
	ИмяОткрываемойФормы = "Документ.ВводОстатковОПродажахЗаПрошлыеПериоды.Форма." + ИмяОткрываемойФормы;
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрытия, , , , , , );
	
КонецПроцедуры

#КонецОбласти