///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии ...
///////////////////////////////////////////////////////////////////////////////////////////////////////

//     * ЗапускатьТолькоВГлавномУзле  - Булево - только для обработчиков отложенного обновления с режимом выполнения Параллельно.
//                                      Указать Истина, если обработчик обновления должен выполняться только в главном
//                                      узле РИБ.
//     * ЗапускатьИВПодчиненномУзлеРИБСФильтрами - Булево - только для обработчиков отложенного обновления с режимом
//                                      выполнения Параллельно,
//                                      Указать Истина, если обработчик обновления должен также выполняться в
//                                      подчиненном узле РИБ с фильтрами.


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем а, _б;
Перем _а Экспорт;
Перем в;

#КонецОбласти

#Если Сервер Тогда
	
#КонецЕсли

Процедура ПередУдалением(Отказ)
	
	// ++
	asdfgsdfg=1;
	// --
	
	
	
	р = 345;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура П1(Знач   А, Б 	=   "", _про)
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Если ДанныеЗаполнения = "АвтоТест" Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ВызватьИсключение "сработала обработка заполнения";
	
КонецПроцедуры

#Область Инициализация

а = 1;
б = 2;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли